Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
//==============================================================================================
//                                         QUORB INC.
//                                STM32L432 PROCESSOR DEFINES
//
//  (C) 2021 QUORB INC.
//  (C) 2021 STMicroelectronics.
//==============================================================================================

//--- If not previously defined then define MAP Header
#ifndef STM32L432MAP_H
  #define STM32L432MAP_H

  //-------------------------------------------------------------------------------------------
  //      System Core Address Block Definitions
  //-------------------------------------------------------------------------------------------
  #define ITM_BASE            (0xE0000000UL)                    //--- ITM Base Address
  #define DWT_BASE            (0xE0001000UL)                    //--- DWT Base Address
  #define SCB_BASE            (0xE000ED00UL)                    //--- System Control Block Base Address
  #define CoreDebug_BASE      (0xE000EDF0UL)                    //--- Core Debug Base Address

  #define SCS_BASE            (0xE000E000UL)                    //--- System Control Space Base Address
  #define SysTick_BASE        (0xE000E010UL)                    //--- SysTick Base Address
  #define NVIC_BASE           (0xE000E100UL)                    //--- NVIC Base Address
  #define SCS_ACTLR           *(vu32*)(SCS_BASE + 0x0008U)      //--- Aux Control

//  #if defined (__MPU_PRESENT) && (__MPU_PRESENT == 1U)
//    #define MPU_BASE          (SCS_BASE +  0x0D90UL)            //--- Memory Protection Unit
//    #define MPU               ((MPU_Type *) MPU_BASE)           //--- Memory Protection Unit
//  #endif

  #define TPI_BASE          (0xE0040000UL)                //--- TPI Base Address
  #define FPU_BASE          (SCS_BASE +  0x0F30UL)        //--- Floating Point Unit
  #define FPU               ((FPU_Type *) FPU_BASE)       //--- Floating Point Unit
  #define FPU_FPCCR         *(vu32*)(FPU_BASE + 0x0004U)  //--- FPU Control
  #define FPU_FPCAR         *(vu32*)(FPU_BASE + 0x0008U)  //--- FPU Contex
  #define FPU_FPDSCR        *(vu32*)(FPU_BASE + 0x000CU)  //--- FPU Status Control

  //-------------------------------------------------------------------------------------------
  //      System Control Block Registers
  //-------------------------------------------------------------------------------------------
  #define SCB_CPUID         *(vu32*)(SCB_BASE + 0x0000U)  //--- CPUID Base
  #define SCB_ICSR          *(vu32*)(SCB_BASE + 0x0004U)  //--- Interrupt Control State
  #define SCB_VTOR          *(vu32*)(SCB_BASE + 0x0008U)  //--- Vector Table Offset
  #define SCB_AIRCR         *(vu32*)(SCB_BASE + 0x000CU)  //--- Application Interrupt Reset
  #define SCB_SCR           *(vu32*)(SCB_BASE + 0x0010U)  //--- System Control Register
  #define SCB_CCR           *(vu32*)(SCB_BASE + 0x0014U)  //--- Configuration Control Register
  #define SCB_SHPR1         *(vu32*)(SCB_BASE + 0x0018U)  //--- System Handler Priority (4,5,6)
  #define SCB_SHPR2         *(vu32*)(SCB_BASE + 0x001CU)  //--- System Handler Priority (11)
  #define SCB_SHPR3         *(vu32*)(SCB_BASE + 0x0020U)  //--- System Handler Priority (14,15)
  #define SCB_SHCSR         *(vu32*)(SCB_BASE + 0x0024U)  //--- System Handler Control
  #define SCB_CFSR          *(vu32*)(SCB_BASE + 0x0028U)  //--- Configurable Fault Status
  #define SCB_MMSR          *(vu32*)(SCB_BASE + 0x0028U)  //--- HardFault Status
  #define SCB_BFSR          *(vu32*)(SCB_BASE + 0x0029U)  //--- BusFault Address
  #define SCB_UFSR          *(vu32*)(SCB_BASE + 0x002AU)  //--- Debug Fault
  #define SCB_HFSR          *(vu32*)(SCB_BASE + 0x002CU)  //--- Auxiliary Fault Status
  #define SCB_MMAR          *(vu32*)(SCB_BASE + 0x0034U)  //--- MemManage Fault Address
  #define SCB_BFAR          *(vu32*)(SCB_BASE + 0x0038U)  //--- MemManage Fault Address
  #define SCB_AFAR          *(vu32*)(SCB_BASE + 0x003CU)  //--- MemManage Fault Address
  #define SCB_CPACR         *(vu32*)(SCB_BASE + 0x0088U)  //--- Coprocessor Access Control

  //-------------------------------------------------------------------------------------------
  //      NVIC Register Definitions
  //-------------------------------------------------------------------------------------------

  typedef struct
  {
    vu32 ISER[8U];               /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register */
          u32 RESERVED0[24U];
    vu32 ICER[8U];               /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register */
          u32 RSERVED1[24U];
    vu32 ISPR[8U];               /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register */
          u32 RESERVED2[24U];
    vu32 ICPR[8U];               /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register */
          u32 RESERVED3[24U];
    vu32 IABR[8U];               /*!< Offset: 0x200 (R/W)  Interrupt Active bit Register */
          u32 RESERVED4[56U];
    vu08 IP[240U];               /*!< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide) */
          u32 RESERVED5[644U];
    vu32  STIR;                  /*!< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register */
  } NVIC_Type;


  #define NVIC                  ((NVIC_Type*) NVIC_BASE)        //--- NVIC configuration struct
  #define NVIC_STIR             (NVIC_BASE + 0x0E00U)

  #define NVIC_ISER             (NVIC_BASE + 0x0000U)
  #define NVIC_ISER0            *(vu32*)(NVIC_BASE + 0x0000U)   //--- NVIC Set Enable (000-031)
  #define NVIC_ISER1            *(vu32*)(NVIC_BASE + 0x0004U)   //--- NVIC Set Enable (032-063)
  #define NVIC_ISER2            *(vu32*)(NVIC_BASE + 0x0008U)   //--- NVIC Set Enable (064-095)
  #define NVIC_ISER3            *(vu32*)(NVIC_BASE + 0x000CU)   //--- NVIC Set Enable (096-127)
  #define NVIC_ISER4            *(vu32*)(NVIC_BASE + 0x0010U)   //--- NVIC Set Enable (128-159)
  #define NVIC_ISER5            *(vu32*)(NVIC_BASE + 0x0014U)   //--- NVIC Set Enable (160-191)
  #define NVIC_ISER6            *(vu32*)(NVIC_BASE + 0x0018U)   //--- NVIC Set Enable (192-223)
  #define NVIC_ISER7            *(vu32*)(NVIC_BASE + 0x001CU)   //--- NVIC Set Enable (224-255)

  #define NVIC_ICER             (NVIC_BASE + 0x0080U)
  #define NVIC_ICER0            *(vu32*)(NVIC_BASE + 0x0080U)   //--- NVIC Clr Enable (000-031)
  #define NVIC_ICER1            *(vu32*)(NVIC_BASE + 0x0084U)   //--- NVIC Clr Enable (032-063)
  #define NVIC_ICER2            *(vu32*)(NVIC_BASE + 0x0088U)   //--- NVIC Clr Enable (064-095)
  #define NVIC_ICER3            *(vu32*)(NVIC_BASE + 0x008CU)   //--- NVIC Clr Enable (096-127)
  #define NVIC_ICER4            *(vu32*)(NVIC_BASE + 0x0090U)   //--- NVIC Clr Enable (128-159)
  #define NVIC_ICER5            *(vu32*)(NVIC_BASE + 0x0094U)   //--- NVIC Clr Enable (160-191)
  #define NVIC_ICER6            *(vu32*)(NVIC_BASE + 0x0098U)   //--- NVIC Clr Enable (192-223)
  #define NVIC_ICER7            *(vu32*)(NVIC_BASE + 0x009CU)   //--- NVIC Clr Enable (224-255)

  #define NVIC_ISPR             (NVIC_BASE + 0x0100U)
  #define NVIC_ISPR0            *(vu32*)(NVIC_BASE + 0x0100U)   //--- NVIC Set Pending (000-031)
  #define NVIC_ISPR1            *(vu32*)(NVIC_BASE + 0x0104U)   //--- NVIC Set Pending (032-063)
  #define NVIC_ISPR2            *(vu32*)(NVIC_BASE + 0x0108U)   //--- NVIC Set Pending (064-095)
  #define NVIC_ISPR3            *(vu32*)(NVIC_BASE + 0x010CU)   //--- NVIC Set Pending (096-127)
  #define NVIC_ISPR4            *(vu32*)(NVIC_BASE + 0x0110U)   //--- NVIC Set Pending (128-159)
  #define NVIC_ISPR5            *(vu32*)(NVIC_BASE + 0x0114U)   //--- NVIC Set Pending (160-191)
  #define NVIC_ISPR6            *(vu32*)(NVIC_BASE + 0x0118U)   //--- NVIC Set Pending (192-223)
  #define NVIC_ISPR7            *(vu32*)(NVIC_BASE + 0x011CU)   //--- NVIC Set Pending (224-255)

  #define NVIC_ICPR             (NVIC_BASE + 0x0080U)   //--- NVIC Clr Pending (000-031)
  #define NVIC_ICPR0            *(vu32*)(NVIC_BASE + 0x0180U)   //--- NVIC Clr Pending (000-031)
  #define NVIC_ICPR1            *(vu32*)(NVIC_BASE + 0x0184U)   //--- NVIC Clr Pending (032-063)
  #define NVIC_ICPR2            *(vu32*)(NVIC_BASE + 0x0188U)   //--- NVIC Clr Pending (064-095)
  #define NVIC_ICPR3            *(vu32*)(NVIC_BASE + 0x018CU)   //--- NVIC Clr Pending (096-127)
  #define NVIC_ICPR4            *(vu32*)(NVIC_BASE + 0x0190U)   //--- NVIC Clr Pending (128-159)
  #define NVIC_ICPR5            *(vu32*)(NVIC_BASE + 0x0194U)   //--- NVIC Clr Pending (160-191)
  #define NVIC_ICPR6            *(vu32*)(NVIC_BASE + 0x0198U)   //--- NVIC Clr Pending (192-223)
  #define NVIC_ICPR7            *(vu32*)(NVIC_BASE + 0x019CU)   //--- NVIC Clr Pending (224-255)

  #define NVIC_IABR0            *(vu32*)(NVIC_BASE + 0x0200U)   //--- NVIC Act | Pend (000-031)
  #define NVIC_IABR1            *(vu32*)(NVIC_BASE + 0x0204U)   //--- NVIC Act | Pend (032-063)
  #define NVIC_IABR2            *(vu32*)(NVIC_BASE + 0x0208U)   //--- NVIC Act | Pend (064-095)
  #define NVIC_IABR3            *(vu32*)(NVIC_BASE + 0x020CU)   //--- NVIC Act | Pend (096-127)
  #define NVIC_IABR4            *(vu32*)(NVIC_BASE + 0x0210U)   //--- NVIC Act | Pend (128-159)
  #define NVIC_IABR5            *(vu32*)(NVIC_BASE + 0x0214U)   //--- NVIC Act | Pend (160-191)
  #define NVIC_IABR6            *(vu32*)(NVIC_BASE + 0x0218U)   //--- NVIC Act | Pend (192-223)
  #define NVIC_IABR7            *(vu32*)(NVIC_BASE + 0x021CU)   //--- NVIC Act | Pend (224-255)

