Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  //--- NVIC Priority Registers 32 Bit Spacing
  #define NVIC_IPRI_BASE        *(vu08*)(NVIC_BASE + 0x00000300)
  #define NVIC_IPRI             *(vu32*)(NVIC_BASE + 0x00000300)

  #define NVIC_PR00_03          *(vu32*)(NVIC_IPRI + 0x0000U)
  #define NVIC_PR04_07          *(vu32*)(NVIC_IPRI + 0x0004U)
  #define NVIC_PR08_11          *(vu32*)(NVIC_IPRI + 0x0008U)
  #define NVIC_PR12_15          *(vu32*)(NVIC_IPRI + 0x000CU)
  #define NVIC_PR16_19          *(vu32*)(NVIC_IPRI + 0x0010U)
  #define NVIC_PR20_23          *(vu32*)(NVIC_IPRI + 0x0014U)
  #define NVIC_PR24_27          *(vu32*)(NVIC_IPRI + 0x0018U)
  #define NVIC_PR28_31          *(vu32*)(NVIC_IPRI + 0x001CU)
  #define NVIC_PR32_35          *(vu32*)(NVIC_IPRI + 0x0020U)
  #define NVIC_PR36_39          *(vu32*)(NVIC_IPRI + 0x0024U)

  #define NVIC_PR40_43          *(vu32*)(NVIC_IPRI + 0x0028U)
  #define NVIC_PR44_47          *(vu32*)(NVIC_IPRI + 0x002CU)
  #define NVIC_PR48_51          *(vu32*)(NVIC_IPRI + 0x0030U)
  #define NVIC_PR52_55          *(vu32*)(NVIC_IPRI + 0x0034U)
  #define NVIC_PR56_59          *(vu32*)(NVIC_IPRI + 0x0038U)
  #define NVIC_PR60_63          *(vu32*)(NVIC_IPRI + 0x003CU)
  #define NVIC_PR64_67          *(vu32*)(NVIC_IPRI + 0x0040U)
  #define NVIC_PR68_71          *(vu32*)(NVIC_IPRI + 0x0044U)
  #define NVIC_PR72_75          *(vu32*)(NVIC_IPRI + 0x0048U)
  #define NVIC_PR76_79          *(vu32*)(NVIC_IPRI + 0x004CU)

  #define NVIC_PR80_83          *(vu32*)(NVIC_IPRI + 0x0050U)
  #define NVIC_PR84_87          *(vu32*)(NVIC_IPRI + 0x0054U)
  #define NVIC_PR88_91          *(vu32*)(NVIC_IPRI + 0x0058U)
  #define NVIC_PR92_95          *(vu32*)(NVIC_IPRI + 0x005CU)
  #define NVIC_PR96_99          *(vu32*)(NVIC_IPRI + 0x0060U)

  //--- NVIC Priority Registers Byte Spacing
  #define NVIC_IPRI_BYTES       (NVIC_BASE + 0x00000300)

  #define NVIC_IPR00            *(vu08*)(NVIC_IPRI_BYTES + 0x0000U)
  #define NVIC_IPR01            *(vu08*)(NVIC_IPRI_BYTES + 0x0001U)
  #define NVIC_IPR02            *(vu08*)(NVIC_IPRI_BYTES + 0x0002U)
  #define NVIC_IPR03            *(vu08*)(NVIC_IPRI_BYTES + 0x0003U)
  #define NVIC_IPR04            *(vu08*)(NVIC_IPRI_BYTES + 0x0004U)
  #define NVIC_IPR05            *(vu08*)(NVIC_IPRI_BYTES + 0x0005U)
  #define NVIC_IPR06            *(vu08*)(NVIC_IPRI_BYTES + 0x0006U)
  #define NVIC_IPR07            *(vu08*)(NVIC_IPRI_BYTES + 0x0007U)
  #define NVIC_IPR08            *(vu08*)(NVIC_IPRI_BYTES + 0x0008U)
  #define NVIC_IPR09            *(vu08*)(NVIC_IPRI_BYTES + 0x0009U)

  #define NVIC_IPR10            *(vu08*)(NVIC_IPRI_BYTES + 0x000AU)
  #define NVIC_IPR11            *(vu08*)(NVIC_IPRI_BYTES + 0x000BU)
  #define NVIC_IPR12            *(vu08*)(NVIC_IPRI_BYTES + 0x000CU)
  #define NVIC_IPR13            *(vu08*)(NVIC_IPRI_BYTES + 0x000DU)
  #define NVIC_IPR14            *(vu08*)(NVIC_IPRI_BYTES + 0x000EU)
  #define NVIC_IPR15            *(vu08*)(NVIC_IPRI_BYTES + 0x000FU)
  #define NVIC_IPR16            *(vu08*)(NVIC_IPRI_BYTES + 0x0010U)
  #define NVIC_IPR17            *(vu08*)(NVIC_IPRI_BYTES + 0x0011U)
  #define NVIC_IPR18            *(vu08*)(NVIC_IPRI_BYTES + 0x0012U)
  #define NVIC_IPR19            *(vu08*)(NVIC_IPRI_BYTES + 0x0013U)

  #define NVIC_IPR20            *(vu08*)(NVIC_IPRI_BYTES + 0x0014U)
  #define NVIC_IPR21            *(vu08*)(NVIC_IPRI_BYTES + 0x0015U)
  #define NVIC_IPR22            *(vu08*)(NVIC_IPRI_BYTES + 0x0016U)
  #define NVIC_IPR23            *(vu08*)(NVIC_IPRI_BYTES + 0x0017U)
  #define NVIC_IPR24            *(vu08*)(NVIC_IPRI_BYTES + 0x0018U)
  #define NVIC_IPR25            *(vu08*)(NVIC_IPRI_BYTES + 0x0019U)
  #define NVIC_IPR26            *(vu08*)(NVIC_IPRI_BYTES + 0x001AU)
  #define NVIC_IPR27            *(vu08*)(NVIC_IPRI_BYTES + 0x001BU)
  #define NVIC_IPR28            *(vu08*)(NVIC_IPRI_BYTES + 0x001CU)
  #define NVIC_IPR29            *(vu08*)(NVIC_IPRI_BYTES + 0x001DU)

  #define NVIC_IPR30            *(vu08*)(NVIC_IPRI_BYTES + 0x001EU)
  #define NVIC_IPR31            *(vu08*)(NVIC_IPRI_BYTES + 0x001FU)
  #define NVIC_IPR32            *(vu08*)(NVIC_IPRI_BYTES + 0x0020U)
  #define NVIC_IPR33            *(vu08*)(NVIC_IPRI_BYTES + 0x0021U)
  #define NVIC_IPR34            *(vu08*)(NVIC_IPRI_BYTES + 0x0022U)
  #define NVIC_IPR35            *(vu08*)(NVIC_IPRI_BYTES + 0x0023U)
  #define NVIC_IPR36            *(vu08*)(NVIC_IPRI_BYTES + 0x0024U)
  #define NVIC_IPR37            *(vu08*)(NVIC_IPRI_BYTES + 0x0025U)
  #define NVIC_IPR38            *(vu08*)(NVIC_IPRI_BYTES + 0x0026U)
  #define NVIC_IPR39            *(vu08*)(NVIC_IPRI_BYTES + 0x0027U)

  #define NVIC_IPR40            *(vu08*)(NVIC_IPRI_BYTES + 0x0028U)
  #define NVIC_IPR41            *(vu08*)(NVIC_IPRI_BYTES + 0x0029U)
  #define NVIC_IPR42            *(vu08*)(NVIC_IPRI_BYTES + 0x002AU)
  #define NVIC_IPR43            *(vu08*)(NVIC_IPRI_BYTES + 0x002BU)
  #define NVIC_IPR44            *(vu08*)(NVIC_IPRI_BYTES + 0x002CU)
  #define NVIC_IPR45            *(vu08*)(NVIC_IPRI_BYTES + 0x002DU)
  #define NVIC_IPR46            *(vu08*)(NVIC_IPRI_BYTES + 0x002EU)
  #define NVIC_IPR47            *(vu08*)(NVIC_IPRI_BYTES + 0x002FU)
  #define NVIC_IPR48            *(vu08*)(NVIC_IPRI_BYTES + 0x0030U)
  #define NVIC_IPR49            *(vu08*)(NVIC_IPRI_BYTES + 0x0031U)

  #define NVIC_IPR50            *(vu08*)(NVIC_IPRI_BYTES + 0x0032U)
  #define NVIC_IPR51            *(vu08*)(NVIC_IPRI_BYTES + 0x0033U)
  #define NVIC_IPR52            *(vu08*)(NVIC_IPRI_BYTES + 0x0034U)
  #define NVIC_IPR53            *(vu08*)(NVIC_IPRI_BYTES + 0x0035U)
  #define NVIC_IPR54            *(vu08*)(NVIC_IPRI_BYTES + 0x0036U)
  #define NVIC_IPR55            *(vu08*)(NVIC_IPRI_BYTES + 0x0037U)
  #define NVIC_IPR56            *(vu08*)(NVIC_IPRI_BYTES + 0x0038U)
  #define NVIC_IPR57            *(vu08*)(NVIC_IPRI_BYTES + 0x0039U)
  #define NVIC_IPR58            *(vu08*)(NVIC_IPRI_BYTES + 0x003AU)
  #define NVIC_IPR59            *(vu08*)(NVIC_IPRI_BYTES + 0x003BU)

  #define NVIC_IPR60            *(vu08*)(NVIC_IPRI_BYTES + 0x003CU)
  #define NVIC_IPR61            *(vu08*)(NVIC_IPRI_BYTES + 0x003DU)
  #define NVIC_IPR62            *(vu08*)(NVIC_IPRI_BYTES + 0x003EU)
  #define NVIC_IPR63            *(vu08*)(NVIC_IPRI_BYTES + 0x003FU)
  #define NVIC_IPR64            *(vu08*)(NVIC_IPRI_BYTES + 0x0040U)
  #define NVIC_IPR65            *(vu08*)(NVIC_IPRI_BYTES + 0x0041U)
  #define NVIC_IPR66            *(vu08*)(NVIC_IPRI_BYTES + 0x0042U)
  #define NVIC_IPR67            *(vu08*)(NVIC_IPRI_BYTES + 0x0043U)
  #define NVIC_IPR68            *(vu08*)(NVIC_IPRI_BYTES + 0x0044U)
  #define NVIC_IPR69            *(vu08*)(NVIC_IPRI_BYTES + 0x0045U)

