Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  #define NVIC_IPR70            *(vu08*)(NVIC_IPRI_BYTES + 0x0046U)
  #define NVIC_IPR71            *(vu08*)(NVIC_IPRI_BYTES + 0x0047U)
  #define NVIC_IPR72            *(vu08*)(NVIC_IPRI_BYTES + 0x0048U)
  #define NVIC_IPR73            *(vu08*)(NVIC_IPRI_BYTES + 0x0049U)
  #define NVIC_IPR74            *(vu08*)(NVIC_IPRI_BYTES + 0x004AU)
  #define NVIC_IPR75            *(vu08*)(NVIC_IPRI_BYTES + 0x004BU)
  #define NVIC_IPR76            *(vu08*)(NVIC_IPRI_BYTES + 0x004CU)
  #define NVIC_IPR77            *(vu08*)(NVIC_IPRI_BYTES + 0x004DU)
  #define NVIC_IPR78            *(vu08*)(NVIC_IPRI_BYTES + 0x004EU)
  #define NVIC_IPR79            *(vu08*)(NVIC_IPRI_BYTES + 0x004FU)

  #define NVIC_IPR80            *(vu08*)(NVIC_IPRI_BYTES + 0x0050U)
  #define NVIC_IPR81            *(vu08*)(NVIC_IPRI_BYTES + 0x0051U)
  #define NVIC_IPR82            *(vu08*)(NVIC_IPRI_BYTES + 0x0052U)
  #define NVIC_IPR83            *(vu08*)(NVIC_IPRI_BYTES + 0x0053U)
  #define NVIC_IPR84            *(vu08*)(NVIC_IPRI_BYTES + 0x0054U)
  #define NVIC_IPR85            *(vu08*)(NVIC_IPRI_BYTES + 0x0055U)
  #define NVIC_IPR86            *(vu08*)(NVIC_IPRI_BYTES + 0x0056U)
  #define NVIC_IPR87            *(vu08*)(NVIC_IPRI_BYTES + 0x0057U)
  #define NVIC_IPR88            *(vu08*)(NVIC_IPRI_BYTES + 0x0058U)
  #define NVIC_IPR89            *(vu08*)(NVIC_IPRI_BYTES + 0x0059U)

  #define NVIC_IPR90            *(vu08*)(NVIC_IPRI_BYTES + 0x005AU)
  #define NVIC_IPR91            *(vu08*)(NVIC_IPRI_BYTES + 0x005BU)
  #define NVIC_IPR92            *(vu08*)(NVIC_IPRI_BYTES + 0x005CU)
  #define NVIC_IPR93            *(vu08*)(NVIC_IPRI_BYTES + 0x005DU)
  #define NVIC_IPR94            *(vu08*)(NVIC_IPRI_BYTES + 0x005EU)
  #define NVIC_IPR95            *(vu08*)(NVIC_IPRI_BYTES + 0x005FU)
  #define NVIC_IPR96            *(vu08*)(NVIC_IPRI_BYTES + 0x0060U)
  #define NVIC_IPR97            *(vu08*)(NVIC_IPRI_BYTES + 0x0061U)
  #define NVIC_IPR98            *(vu08*)(NVIC_IPRI_BYTES + 0x0062U)
  #define NVIC_IPR99            *(vu08*)(NVIC_IPRI_BYTES + 0x0063U)

  //-------------------------------------------------------------------------------------------
  //  Peripherial Base Address Definitions
  //-------------------------------------------------------------------------------------------
  #define FLASH_BASE            (0x08000000UL) //--- FLASH(up to 256 KB) base address
  #define SRAM1_BASE            (0x20000000UL) //--- SRAM1(up to 48 KB) base address
  #define SRAM2_BASE            (0x10000000UL) //--- SRAM2(16 KB) base address
  #define PERIPH_BASE           (0x40000000UL) //--- Peripheral base address
  #define QSPI_BASE             (0x90000000UL) //--- QUADSPI memories accessible over AHB base address

  #define QSPI_R_BASE           (0xA0001000UL) //--- QUADSPI control registers base address
  #define SRAM1_BB_BASE         (0x22000000UL) //--- SRAM1(96 KB) base address in the bit-band region
  #define PERIPH_BB_BASE        (0x42000000UL) //--- Peripheral base address in the bit-band region

  //--- Legacy defines
  #define SRAM_BASE             SRAM1_BASE
  #define SRAM_BB_BASE          SRAM1_BB_BASE

  #define SRAM1_SIZE_MAX        (0x0000C000UL) //--- maximum SRAM1 size (up to 48 KBytes)
  #define SRAM2_SIZE            (0x00004000UL) //--- SRAM2 size (16 KBytes)

  //--- Peripheral memory map
  #define APB1PERIPH_BASE       (PERIPH_BASE + 0x00000000UL)
  #define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
  #define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
  #define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000UL)

  //--- APB1 peripherals
  #define TIM2_BASE             (APB1PERIPH_BASE + 0x0000UL)
  #define TIM6_BASE             (APB1PERIPH_BASE + 0x1000UL)
  #define TIM7_BASE             (APB1PERIPH_BASE + 0x1400UL)
  #define RTC_BASE              (APB1PERIPH_BASE + 0x2800UL)
  #define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00UL)
  #define IWDG_BASE             (APB1PERIPH_BASE + 0x3000UL)
  #define SPI2_BASE             (APB1PERIPH_BASE + 0x3800UL)
  #define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00UL)
  #define USART2_BASE           (APB1PERIPH_BASE + 0x4400UL)
  #define USART3_BASE           (APB1PERIPH_BASE + 0x4800UL)
  #define I2C1_BASE             (APB1PERIPH_BASE + 0x5400UL)
  #define I2C2_BASE             (APB1PERIPH_BASE + 0x5800UL)
  #define I2C3_BASE             (APB1PERIPH_BASE + 0x5C00UL)
  #define CRS_BASE              (APB1PERIPH_BASE + 0x6000UL)
  #define CAN1_BASE             (APB1PERIPH_BASE + 0x6400UL)
  #define USB_BASE              (APB1PERIPH_BASE + 0x6800UL)  //--- USB_IP Peripheral Registers base address
  #define USB_PMAADDR           (APB1PERIPH_BASE + 0x6C00UL)  //--- USB_IP Packet Memory Area base address
  #define PWR_R_BASE            (APB1PERIPH_BASE + 0x7000UL)
  #define DAC1_BASE             (APB1PERIPH_BASE + 0x7400UL)
  #define OPAMP_BASE            (APB1PERIPH_BASE + 0x7800UL)
  #define OPAMP1_BASE           (APB1PERIPH_BASE + 0x7800UL)
  #define LPTIM1_BASE           (APB1PERIPH_BASE + 0x7C00UL)
  #define LPUART1_BASE          (APB1PERIPH_BASE + 0x8000UL)
  #define SWPMI1_BASE           (APB1PERIPH_BASE + 0x8800UL)
  #define LPTIM2_BASE           (APB1PERIPH_BASE + 0x9400UL)

  //--- APB2 peripherals
  #define SYSCFG_BASE           (APB2PERIPH_BASE + 0x0000UL)
  #define VREFBUF_BASE          (APB2PERIPH_BASE + 0x0030UL)
  #define COMP1_BASE            (APB2PERIPH_BASE + 0x0200UL)
  #define COMP2_BASE            (APB2PERIPH_BASE + 0x0204UL)
  #define EXTI_BASE             (APB2PERIPH_BASE + 0x0400UL)
  #define FIREWALL_BASE         (APB2PERIPH_BASE + 0x1C00UL)
  #define SDMMC1_BASE           (APB2PERIPH_BASE + 0x2800UL)
  #define TIM1_BASE             (APB2PERIPH_BASE + 0x2C00UL)
  #define SPI1_BASE             (APB2PERIPH_BASE + 0x3000UL)
  #define USART1_BASE           (APB2PERIPH_BASE + 0x3800UL)
  #define TIM15_BASE            (APB2PERIPH_BASE + 0x4000UL)
  #define TIM16_BASE            (APB2PERIPH_BASE + 0x4400UL)
  #define SAI1_BASE             (APB2PERIPH_BASE + 0x5400UL)
  #define SAI1_Block_A_BASE     (SAI1_BASE + 0x0004UL)
  #define SAI1_Block_B_BASE     (SAI1_BASE + 0x0024UL)

  //--- AHB1 peripherals
  #define DMA1_BASE             (AHB1PERIPH_BASE)
  #define DMA2_BASE             (AHB1PERIPH_BASE + 0x0400UL)
  #define RCC_BASE              (AHB1PERIPH_BASE + 0x1000UL)
  #define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x2000UL)
  #define CRC_BASE              (AHB1PERIPH_BASE + 0x3000UL)
  #define TSC_BASE              (AHB1PERIPH_BASE + 0x4000UL)

  //--- DMA Definitions
  #define DMA1_Channel1_BASE    (DMA1_BASE + 0x0008UL)
  #define DMA1_Channel2_BASE    (DMA1_BASE + 0x001CUL)
  #define DMA1_Channel3_BASE    (DMA1_BASE + 0x0030UL)
  #define DMA1_Channel4_BASE    (DMA1_BASE + 0x0044UL)
  #define DMA1_Channel5_BASE    (DMA1_BASE + 0x0058UL)
  #define DMA1_Channel6_BASE    (DMA1_BASE + 0x006CUL)
  #define DMA1_Channel7_BASE    (DMA1_BASE + 0x0080UL)
  #define DMA1_CSELR_BASE       (DMA1_BASE + 0x00A8UL)

  #define DMA2_Channel1_BASE    (DMA2_BASE + 0x0008UL)
  #define DMA2_Channel2_BASE    (DMA2_BASE + 0x001CUL)
  #define DMA2_Channel3_BASE    (DMA2_BASE + 0x0030UL)
  #define DMA2_Channel4_BASE    (DMA2_BASE + 0x0044UL)
  #define DMA2_Channel5_BASE    (DMA2_BASE + 0x0058UL)
  #define DMA2_Channel6_BASE    (DMA2_BASE + 0x006CUL)
  #define DMA2_Channel7_BASE    (DMA2_BASE + 0x0080UL)
  #define DMA2_CSELR_BASE       (DMA2_BASE + 0x00A8UL)

