Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  //--- AHB2 peripherals
  #define GPIOA_BASE            (AHB2PERIPH_BASE + 0x0000UL)
  #define GPIOB_BASE            (AHB2PERIPH_BASE + 0x0400UL)
  #define GPIOC_BASE            (AHB2PERIPH_BASE + 0x0800UL)
  #define GPIOD_BASE            (AHB2PERIPH_BASE + 0x0C00UL)
  #define GPIOE_BASE            (AHB2PERIPH_BASE + 0x1000UL)
  #define GPIOF_BASE            (AHB2PERIPH_BASE + 0x1400UL)
  #define GPIOG_BASE            (AHB2PERIPH_BASE + 0x1800UL)
  #define GPIOH_BASE            (AHB2PERIPH_BASE + 0x1C00UL)
  #define GPIOI_BASE            (AHB2PERIPH_BASE + 0x2000UL)
  #define GPIOJ_BASE            (AHB2PERIPH_BASE + 0x2400UL)
  #define GPIOK_BASE            (AHB2PERIPH_BASE + 0x2C00UL)

  #define ADC1_BASE             (AHB2PERIPH_BASE + 0x08040000UL)
  #define ADC1_COMMON_BASE      (AHB2PERIPH_BASE + 0x08040300UL)

  #define RNG_BASE              (AHB2PERIPH_BASE + 0x08060800UL)

  //--- Debug MCU registers base address
  #define DBGMCU_BASE           (0xE0042000UL)
  #define PACKAGE_BASE          (0x1FFF7500UL)        //--- Package data register base address
  #define UID_BASE              (0x1FFF7590UL)        //--- Unique device ID register base address
  #define FLASHSIZE_BASE        (0x1FFF75E0UL)        //--- Flash size data register base address

  //-------------------------------------------------------------------------------------------
  //      SysTick Configuration Registers  SysTick_BASE = 0xE000E010UL
  //-------------------------------------------------------------------------------------------

  #define STK_CTRL            *(vu32 *)(SysTick_BASE + 0x00000000)
  #define STK_LOAD            *(vu32 *)(SysTick_BASE + 0x00000004)
  #define STK_VAL             *(vu32 *)(SysTick_BASE + 0x00000008)
  #define STK_CALIB           *(vu32 *)(SysTick_BASE + 0x0000000C)

  //-------------------------------------------------------------------------------------------
  //      Power Configuration Registers
  //-------------------------------------------------------------------------------------------
  #define PWR_CR1               *(vu32 *)(PWR_R_BASE + 0x00000000)
  #define PWR_CR2               *(vu32 *)(PWR_R_BASE + 0x00000004)
  #define PWR_CR3               *(vu32 *)(PWR_R_BASE + 0x00000008)
  #define PWR_CR4               *(vu32 *)(PWR_R_BASE + 0x0000000C)
  #define PWR_SR1               *(vu32 *)(PWR_R_BASE + 0x00000010)
  #define PWR_SR2               *(vu32 *)(PWR_R_BASE + 0x00000014)
  #define PWR_SCR               *(vu32 *)(PWR_R_BASE + 0x00000018)
  #define PWR_PUCRA             *(vu32 *)(PWR_R_BASE + 0x00000020)
  #define PWR_PDCRA             *(vu32 *)(PWR_R_BASE + 0x00000024)
  #define PWR_PUCRB             *(vu32 *)(PWR_R_BASE + 0x00000028)
  #define PWR_PDCRB             *(vu32 *)(PWR_R_BASE + 0x0000002C)
  #define PWR_PUCRC             *(vu32 *)(PWR_R_BASE + 0x00000030)
  #define PWR_PDCRC             *(vu32 *)(PWR_R_BASE + 0x00000034)
  #define PWR_PUCRD             *(vu32 *)(PWR_R_BASE + 0x0000003C)
  #define PWR_PUCRE             *(vu32 *)(PWR_R_BASE + 0x00000040)
  #define PWR_PDCRE             *(vu32 *)(PWR_R_BASE + 0x00000044)

  //-------------------------------------------------------------------------------------------
  //      VREFBUF Voltage Control Registers
  //      VREFBUF_BASE           0x40010030
  //-------------------------------------------------------------------------------------------
  #define VREFBUF_CSR           *(vu32 *)(VREFBUF_BASE + 0x00000000UL)
  #define VREFBUF_CCR           *(vu32 *)(VREFBUF_BASE + 0x00000004UL)

 //-------------------------------------------------------------------------------------------
  //      FLASH Control Registers
  //-------------------------------------------------------------------------------------------
  #define FLASH_ACR             *(vu32 *)(FLASH_R_BASE + 0x00000000)
  #define FLASH_PDKEYR          *(vu32 *)(FLASH_R_BASE + 0x00000004)
  #define FLASH_KEYR            *(vu32 *)(FLASH_R_BASE + 0x00000008)
  #define FLASH_OPTKEYR         *(vu32 *)(FLASH_R_BASE + 0x0000000C)
  #define FLASH_SR              *(vu32 *)(FLASH_R_BASE + 0x00000010)
  #define FLASH_CR              *(vu32 *)(FLASH_R_BASE + 0x00000014)
  #define FLASH_ECCR            *(vu32 *)(FLASH_R_BASE + 0x00000018)
  #define FLASH_OPTR            *(vu32 *)(FLASH_R_BASE + 0x00000020)
  #define FLASH_PCROP1SR        *(vu32 *)(FLASH_R_BASE + 0x00000024)
  #define FLASH_PCROP1ER        *(vu32 *)(FLASH_R_BASE + 0x00000028)
  #define FLASH_WRP1AR          *(vu32 *)(FLASH_R_BASE + 0x0000002C)
  #define FLASH_WRB1PR          *(vu32 *)(FLASH_R_BASE + 0x00000030)

  //-------------------------------------------------------------------------------------------
  //      RCC Control Registers
  //-------------------------------------------------------------------------------------------
  #define RCC_CR                *(vu32 *)(RCC_BASE + 0x00000000)
  #define RCC_ICSCR             *(vu32 *)(RCC_BASE + 0x00000004)
  #define RCC_CFGR              *(vu32 *)(RCC_BASE + 0x00000008)
  #define RCC_PLLCFGR           *(vu32 *)(RCC_BASE + 0x0000000C)
  #define RCC_PLLSAI1CFGR       *(vu32 *)(RCC_BASE + 0x00000010)

  #define RCC_CIER              *(vu32 *)(RCC_BASE + 0x00000018)
  #define RCC_CIFR              *(vu32 *)(RCC_BASE + 0x0000001C)
  #define RCC_CICR              *(vu32 *)(RCC_BASE + 0x00000020)
  #define RCC_AHB1RSTR          *(vu32 *)(RCC_BASE + 0x00000028)
  #define RCC_AHB2RSTR          *(vu32 *)(RCC_BASE + 0x0000002C)
  #define RCC_AHB3RSTR          *(vu32 *)(RCC_BASE + 0x00000030)

  #define RCC_APB1RSTR1         *(vu32 *)(RCC_BASE + 0x00000038)
  #define RCC_APB1RSTR2         *(vu32 *)(RCC_BASE + 0x0000003C)

  #define RCC_APB2RSTR          *(vu32 *)(RCC_BASE + 0x00000040)

  #define RCC_AHB1ENR           *(vu32 *)(RCC_BASE + 0x00000048)
  #define RCC_AHB2ENR           *(vu32 *)(RCC_BASE + 0x0000004C)
  #define RCC_AHB3ENR           *(vu32 *)(RCC_BASE + 0x00000050)

  #define RCC_APB1ENR1          *(vu32 *)(RCC_BASE + 0x00000058)
  #define RCC_APB1ENR2          *(vu32 *)(RCC_BASE + 0x0000005C)

  #define RCC_APB2ENR           *(vu32 *)(RCC_BASE + 0x00000060)

