Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  #define RCC_AHB1SMENR         *(vu32 *)(RCC_BASE + 0x00000068)
  #define RCC_AHB2SMENR         *(vu32 *)(RCC_BASE + 0x0000006C)
  #define RCC_AHB3SMENR         *(vu32 *)(RCC_BASE + 0x00000070)

  #define RCC_APB1SMENR1        *(vu32 *)(RCC_BASE + 0x00000078)
  #define RCC_APB1SMENR2        *(vu32 *)(RCC_BASE + 0x0000007C)

  #define RCC_APB2SMENR         *(vu32 *)(RCC_BASE + 0x00000080)

  #define RCC_CCIPR             *(vu32 *)(RCC_BASE + 0x00000088)
  #define RCC_BDCR              *(vu32 *)(RCC_BASE + 0x00000090)
  #define RCC_CSR               *(vu32 *)(RCC_BASE + 0x00000094)
  #define RCC_CRRCR             *(vu32 *)(RCC_BASE + 0x00000098)
  #define RCC_CCIPR2            *(vu32 *)(RCC_BASE + 0x0000009C)

  //-------------------------------------------------------------------------------------------
  //    GPIO Register Maps
  //-------------------------------------------------------------------------------------------
  //--- GPIO-A
  #define GPIOA_MODER           *(vu32 *)(GPIOA_BASE + 0x00000000)
  #define GPIOA_OTYPER          *(vu32 *)(GPIOA_BASE + 0x00000004)
  #define GPIOA_OSPEEDR         *(vu32 *)(GPIOA_BASE + 0x00000008)
  #define GPIOA_PUPDR           *(vu32 *)(GPIOA_BASE + 0x0000000C)
  #define GPIOA_IDR             *(vu32 *)(GPIOA_BASE + 0x00000010)
  #define GPIOA_ODR             *(vu32 *)(GPIOA_BASE + 0x00000014)
  #define GPIOA_BSRR            *(vu32 *)(GPIOA_BASE + 0x00000018)
  #define GPIOA_LCKR            *(vu32 *)(GPIOA_BASE + 0x0000001C)
  #define GPIOA_AFRL            *(vu32 *)(GPIOA_BASE + 0x00000020)
  #define GPIOA_AFRH            *(vu32 *)(GPIOA_BASE + 0x00000024)

  //--- GPIO-B
  #define GPIOB_MODER           *(vu32 *)(GPIOB_BASE + 0x00000000)
  #define GPIOB_OTYPER          *(vu32 *)(GPIOB_BASE + 0x00000004)
  #define GPIOB_OSPEEDR         *(vu32 *)(GPIOB_BASE + 0x00000008)
  #define GPIOB_PUPDR           *(vu32 *)(GPIOB_BASE + 0x0000000C)
  #define GPIOB_IDR             *(vu32 *)(GPIOB_BASE + 0x00000010)
  #define GPIOB_ODR             *(vu32 *)(GPIOB_BASE + 0x00000014)
  #define GPIOB_BSRR            *(vu32 *)(GPIOB_BASE + 0x00000018)
  #define GPIOB_LCKR            *(vu32 *)(GPIOB_BASE + 0x0000001C)
  #define GPIOB_AFRL            *(vu32 *)(GPIOB_BASE + 0x00000020)
  #define GPIOB_AFRH            *(vu32 *)(GPIOB_BASE + 0x00000024)

  //--- GPIO-C
  #define GPIOC_MODER           *(vu32 *)(GPIOC_BASE + 0x00000000)
  #define GPIOC_OTYPER          *(vu32 *)(GPIOC_BASE + 0x00000004)
  #define GPIOC_OSPEEDR         *(vu32 *)(GPIOC_BASE + 0x00000008)
  #define GPIOC_PUPDR           *(vu32 *)(GPIOC_BASE + 0x0000000C)
  #define GPIOC_IDR             *(vu32 *)(GPIOC_BASE + 0x00000010)
  #define GPIOC_ODR             *(vu32 *)(GPIOC_BASE + 0x00000014)
  #define GPIOC_BSRR            *(vu32 *)(GPIOC_BASE + 0x00000018)
  #define GPIOC_LCKR            *(vu32 *)(GPIOC_BASE + 0x0000001C)
  #define GPIOC_AFRL            *(vu32 *)(GPIOC_BASE + 0x00000020)
  #define GPIOC_AFRH            *(vu32 *)(GPIOC_BASE + 0x00000024)

  //--- GPIO-D
  #define GPIOD_MODER           *(vu32 *)(GPIOD_BASE + 0x00000000)
  #define GPIOD_OTYPER          *(vu32 *)(GPIOD_BASE + 0x00000004)
  #define GPIOD_OSPEEDR         *(vu32 *)(GPIOD_BASE + 0x00000008)
  #define GPIOD_PUPDR           *(vu32 *)(GPIOD_BASE + 0x0000000C)
  #define GPIOD_IDR             *(vu32 *)(GPIOD_BASE + 0x00000010)
  #define GPIOD_ODR             *(vu32 *)(GPIOD_BASE + 0x00000014)
  #define GPIOD_BSRR            *(vu32 *)(GPIOD_BASE + 0x00000018)
  #define GPIOD_LCKR            *(vu32 *)(GPIOD_BASE + 0x0000001C)
  #define GPIOD_AFRL            *(vu32 *)(GPIOD_BASE + 0x00000020)
  #define GPIOD_AFRH            *(vu32 *)(GPIOD_BASE + 0x00000024)

  //--- GPIO-E
  #define GPIOE_MODER           *(vu32 *)(GPIOE_BASE + 0x00000000)
  #define GPIOE_OTYPER          *(vu32 *)(GPIOE_BASE + 0x00000004)
  #define GPIOE_OSPEEDR         *(vu32 *)(GPIOE_BASE + 0x00000008)
  #define GPIOE_PUPDR           *(vu32 *)(GPIOE_BASE + 0x0000000C)
  #define GPIOE_IDR             *(vu32 *)(GPIOE_BASE + 0x00000010)
  #define GPIOE_ODR             *(vu32 *)(GPIOE_BASE + 0x00000014)
  #define GPIOE_BSRR            *(vu32 *)(GPIOE_BASE + 0x00000018)
  #define GPIOE_LCKR            *(vu32 *)(GPIOE_BASE + 0x0000001C)
  #define GPIOE_AFRL            *(vu32 *)(GPIOE_BASE + 0x00000020)
  #define GPIOE_AFRH            *(vu32 *)(GPIOE_BASE + 0x00000024)

  //--- GPIO-F
  #define GPIOF_MODER           *(vu32 *)(GPIOF_BASE + 0x00000000)
  #define GPIOF_OTYPER          *(vu32 *)(GPIOF_BASE + 0x00000004)
  #define GPIOF_OSPEEDR         *(vu32 *)(GPIOF_BASE + 0x00000008)
  #define GPIOF_PUPDR           *(vu32 *)(GPIOF_BASE + 0x0000000C)
  #define GPIOF_IDR             *(vu32 *)(GPIOF_BASE + 0x00000010)
  #define GPIOF_ODR             *(vu32 *)(GPIOF_BASE + 0x00000014)
  #define GPIOF_BSRR            *(vu32 *)(GPIOF_BASE + 0x00000018)
  #define GPIOF_LCKR            *(vu32 *)(GPIOF_BASE + 0x0000001C)
  #define GPIOF_AFRL            *(vu32 *)(GPIOF_BASE + 0x00000020)
  #define GPIOF_AFRH            *(vu32 *)(GPIOF_BASE + 0x00000024)

  //--- GPIO-G
  #define GPIOG_MODER           *(vu32 *)(GPIOG_BASE + 0x00000000)
  #define GPIOG_OTYPER          *(vu32 *)(GPIOG_BASE + 0x00000004)
  #define GPIOG_OSPEEDR         *(vu32 *)(GPIOG_BASE + 0x00000008)
  #define GPIOG_PUPDR           *(vu32 *)(GPIOG_BASE + 0x0000000C)
  #define GPIOG_IDR             *(vu32 *)(GPIOG_BASE + 0x00000010)
  #define GPIOG_ODR             *(vu32 *)(GPIOG_BASE + 0x00000014)
  #define GPIOG_BSRR            *(vu32 *)(GPIOG_BASE + 0x00000018)
  #define GPIOG_LCKR            *(vu32 *)(GPIOG_BASE + 0x0000001C)
  #define GPIOG_AFRL            *(vu32 *)(GPIOG_BASE + 0x00000020)
  #define GPIOG_AFRH            *(vu32 *)(GPIOG_BASE + 0x00000024)

  //--- GPIO-H
  #define GPIOH_MODER           *(vu32 *)(GPIOH_BASE + 0x00000000)
  #define GPIOH_OTYPER          *(vu32 *)(GPIOH_BASE + 0x00000004)
  #define GPIOH_OSPEEDR         *(vu32 *)(GPIOH_BASE + 0x00000008)
  #define GPIOH_PUPDR           *(vu32 *)(GPIOH_BASE + 0x0000000C)
  #define GPIOH_IDR             *(vu32 *)(GPIOH_BASE + 0x00000010)
  #define GPIOH_ODR             *(vu32 *)(GPIOH_BASE + 0x00000014)
  #define GPIOH_BSRR            *(vu32 *)(GPIOH_BASE + 0x00000018)
  #define GPIOH_LCKR            *(vu32 *)(GPIOH_BASE + 0x0000001C)
  #define GPIOH_AFRL            *(vu32 *)(GPIOH_BASE + 0x00000020)
  #define GPIOH_AFRH            *(vu32 *)(GPIOH_BASE + 0x00000024)

  //--- GPIO-I
  #define GPIOI_MODER           *(vu32 *)(GPIOI_BASE + 0x00000000)
  #define GPIOI_OTYPER          *(vu32 *)(GPIOI_BASE + 0x00000004)
  #define GPIOI_OSPEEDR         *(vu32 *)(GPIOI_BASE + 0x00000008)
  #define GPIOI_PUPDR           *(vu32 *)(GPIOI_BASE + 0x0000000C)
  #define GPIOI_IDR             *(vu32 *)(GPIOI_BASE + 0x00000010)
  #define GPIOI_ODR             *(vu32 *)(GPIOI_BASE + 0x00000014)
  #define GPIOI_BSRR            *(vu32 *)(GPIOI_BASE + 0x00000018)
  #define GPIOI_LCKR            *(vu32 *)(GPIOI_BASE + 0x0000001C)
  #define GPIOI_AFRL            *(vu32 *)(GPIOI_BASE + 0x00000020)
  #define GPIOI_AFRH            *(vu32 *)(GPIOI_BASE + 0x00000024)

