Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  //--- GPIO-J
  #define GPIOJ_MODER           *(vu32 *)(GPIOJ_BASE + 0x00000000)
  #define GPIOJ_OTYPER          *(vu32 *)(GPIOJ_BASE + 0x00000004)
  #define GPIOJ_OSPEEDR         *(vu32 *)(GPIOJ_BASE + 0x00000008)
  #define GPIOJ_PUPDR           *(vu32 *)(GPIOJ_BASE + 0x0000000C)
  #define GPIOJ_IDR             *(vu32 *)(GPIOJ_BASE + 0x00000010)
  #define GPIOJ_ODR             *(vu32 *)(GPIOJ_BASE + 0x00000014)
  #define GPIOJ_BSRR            *(vu32 *)(GPIOJ_BASE + 0x00000018)
  #define GPIOJ_LCKR            *(vu32 *)(GPIOJ_BASE + 0x0000001C)
  #define GPIOJ_AFRL            *(vu32 *)(GPIOJ_BASE + 0x00000020)
  #define GPIOJ_AFRH            *(vu32 *)(GPIOJ_BASE + 0x00000024)

  //--- GPIO-K
  #define GPIOK_MODER           *(vu32 *)(GPIOK_BASE + 0x00000000)
  #define GPIOK_OTYPER          *(vu32 *)(GPIOK_BASE + 0x00000004)
  #define GPIOK_OSPEEDR         *(vu32 *)(GPIOK_BASE + 0x00000008)
  #define GPIOK_PUPDR           *(vu32 *)(GPIOK_BASE + 0x0000000C)
  #define GPIOK_IDR             *(vu32 *)(GPIOK_BASE + 0x00000010)
  #define GPIOK_ODR             *(vu32 *)(GPIOK_BASE + 0x00000014)
  #define GPIOK_BSRR            *(vu32 *)(GPIOK_BASE + 0x00000018)
  #define GPIOK_LCKR            *(vu32 *)(GPIOK_BASE + 0x0000001C)
  #define GPIOK_AFRL            *(vu32 *)(GPIOK_BASE + 0x00000020)
  #define GPIOK_AFRH            *(vu32 *)(GPIOK_BASE + 0x00000024)

  //------------------------------------------------------------------------------------------
  //  GPIO Pin Number Defines   - This gives each I/O Pin a Unique Number (00 to FF)
  //  The Hi Nibble = the Port (A - K)  the Lo Nibble = Port Pin Number (0 - 15) = (0 - F)
  //------------------------------------------------------------------------------------------
  #define PA00    0x00
  #define PA01    0x01
  #define PA02    0x02
  #define PA03    0x03
  #define PA04    0x04
  #define PA05    0x05
  #define PA06    0x06
  #define PA07    0x07
  #define PA08    0x08
  #define PA09    0x09
  #define PA10    0x0A
  #define PA11    0x0B
  #define PA12    0x0C
  #define PA13    0x0D
  #define PA14    0x0E
  #define PA15    0x0F

  #define PB00    0x10
  #define PB01    0x11
  #define PB02    0x12
  #define PB03    0x13
  #define PB04    0x14
  #define PB05    0x15
  #define PB06    0x16
  #define PB07    0x17
  #define PB08    0x18
  #define PB09    0x19
  #define PB10    0x1A
  #define PB11    0x1B
  #define PB12    0x1C
  #define PB13    0x1D
  #define PB14    0x1E
  #define PB15    0x1F

  #define PC00    0x20
  #define PC01    0x21
  #define PC02    0x22
  #define PC03    0x23
  #define PC04    0x24
  #define PC05    0x25
  #define PC06    0x26
  #define PC07    0x27
  #define PC08    0x28
  #define PC09    0x29
  #define PC10    0x2A
  #define PC11    0x2B
  #define PC12    0x2C
  #define PC13    0x2D
  #define PC14    0x2E
  #define PC15    0x2F

  #define PD00    0x30
  #define PD01    0x31
  #define PD02    0x32
  #define PD03    0x33
  #define PD04    0x34
  #define PD05    0x35
  #define PD06    0x36
  #define PD07    0x37
  #define PD08    0x38
  #define PD09    0x39
  #define PD10    0x3A
  #define PD11    0x3B
  #define PD12    0x3C
  #define PD13    0x3D
  #define PD14    0x3E
  #define PD15    0x3F

  #define PE00    0x40
  #define PE01    0x41
  #define PE02    0x42
  #define PE03    0x43
  #define PE04    0x44
  #define PE05    0x45
  #define PE06    0x46
  #define PE07    0x47
  #define PE08    0x48
  #define PE09    0x49
  #define PE10    0x4A
  #define PE11    0x4B
  #define PE12    0x4C
  #define PE13    0x4D
  #define PE14    0x4E
  #define PE15    0x4F

  #define PF00    0x50
  #define PF01    0x51
  #define PF02    0x52
  #define PF03    0x53
  #define PF04    0x54
  #define PF05    0x55
  #define PF06    0x56
  #define PF07    0x57
  #define PF08    0x58
  #define PF09    0x59
  #define PF10    0x5A
  #define PF11    0x5B
  #define PF12    0x5C
  #define PF13    0x5D
  #define PF14    0x5E
  #define PF15    0x5F

  #define PG00    0x60
  #define PG01    0x61
  #define PG02    0x62
  #define PG03    0x63
  #define PG04    0x64
  #define PG05    0x65
  #define PG06    0x66
  #define PG07    0x67
  #define PG08    0x68
  #define PG09    0x69
  #define PG10    0x6A
  #define PG11    0x6B
  #define PG12    0x6C
  #define PG13    0x6D
  #define PG14    0x6E
  #define PG15    0x6F

  #define PH00    0x70
  #define PH01    0x71
  #define PH02    0x72
  #define PH03    0x73
  #define PH04    0x74
  #define PH05    0x75
  #define PH06    0x76
  #define PH07    0x77
  #define PH08    0x78
  #define PH09    0x79
  #define PH10    0x7A
  #define PH11    0x7B
  #define PH12    0x7C
  #define PH13    0x7D
  #define PH14    0x7E
  #define PH15    0x7F

  #define PI00    0x80
  #define PI01    0x81
  #define PI02    0x82
  #define PI03    0x83
  #define PI04    0x84
  #define PI05    0x85
  #define PI06    0x86
  #define PI07    0x87
  #define PI08    0x88
  #define PI09    0x89
  #define PI10    0x8A
  #define PI11    0x8B
  #define PI12    0x8C
  #define PI13    0x8D
  #define PI14    0x8E
  #define PI15    0x8F

  #define PJ00    0x90
  #define PJ01    0x91
  #define PJ02    0x92
  #define PJ03    0x93
  #define PJ04    0x94
  #define PJ05    0x95
  #define PJ06    0x96
  #define PJ07    0x97
  #define PJ08    0x98
  #define PJ09    0x99
  #define PJ10    0x9A
  #define PJ11    0x9B
  #define PJ12    0x9C
  #define PJ13    0x9D
  #define PJ14    0x9E
  #define PJ15    0x9F

  #define PK00    0xA0
  #define PK01    0xA1
  #define PK02    0xA2
  #define PK03    0xA3
  #define PK04    0xA4
  #define PK05    0xA5
  #define PK06    0xA6
  #define PK07    0xA7
  #define PK08    0xA8
  #define PK09    0xA9
  #define PK10    0xAA
  #define PK11    0xAB
  #define PK12    0xAC
  #define PK13    0xAD
  #define PK14    0xAE
  #define PK15    0xAF

  //-------------------------------------------------------------------------------------------
  //      ADC REGISTERS
  //-------------------------------------------------------------------------------------------
  //--- ADC1 Registers
  #define ADC1_SR               *(vu32 *)(ADC1_BASE + 0x00000000)
  #define ADC1_CR1              *(vu32 *)(ADC1_BASE + 0x00000004)
  #define ADC1_CR2              *(vu32 *)(ADC1_BASE + 0x00000008)
  #define ADC1_SMPR1            *(vu32 *)(ADC1_BASE + 0x0000000C)
  #define ADC1_SMPR2            *(vu32 *)(ADC1_BASE + 0x00000010)
  #define ADC1_JOFR1            *(vu32 *)(ADC1_BASE + 0x00000014)
  #define ADC1_JOFR2            *(vu32 *)(ADC1_BASE + 0x00000018)
  #define ADC1_JOFR3            *(vu32 *)(ADC1_BASE + 0x0000001C)
  #define ADC1_JOFR4            *(vu32 *)(ADC1_BASE + 0x00000020)
  #define ADC1_HTR              *(vu32 *)(ADC1_BASE + 0x00000024)
  #define ADC1_LTR              *(vu32 *)(ADC1_BASE + 0x00000028)
  #define ADC1_SQR1             *(vu32 *)(ADC1_BASE + 0x0000002C)
  #define ADC1_SQR2             *(vu32 *)(ADC1_BASE + 0x00000030)
  #define ADC1_SQR3             *(vu32 *)(ADC1_BASE + 0x00000034)
  #define ADC1_JSQR             *(vu32 *)(ADC1_BASE + 0x00000038)
  #define ADC1_JDR1             *(vu32 *)(ADC1_BASE + 0x0000003C)
  #define ADC1_JDR2             *(vu32 *)(ADC1_BASE + 0x00000040)
  #define ADC1_JDR3             *(vu32 *)(ADC1_BASE + 0x00000044)
  #define ADC1_JDR4             *(vu32 *)(ADC1_BASE + 0x00000048)
  #define ADC1_DR               *(vu32 *)(ADC1_BASE + 0x0000004C)

  #define ADC_CSR               *(vu32 *)(ADC1_BASE + 0x00000300)
  #define ADC_CCR               *(vu32 *)(ADC1_BASE + 0x00000304)
  #define ADC_CDR               *(vu32 *)(ADC1_BASE + 0x00000304)

  //-------------------------------------------------------------------------------------------
  //      UART Registers
  //-------------------------------------------------------------------------------------------
  //--- UART # 1 Registers
  #define USART1_SR             *(vu32 *)(USART1_BASE + 0x00000000)
  #define USART1_DR             *(vu32 *)(USART1_BASE + 0x00000004)
  #define USART1_BRR            *(vu32 *)(USART1_BASE + 0x00000008)
  #define USART1_CR1            *(vu32 *)(USART1_BASE + 0x0000000C)
  #define USART1_CR2            *(vu32 *)(USART1_BASE + 0x00000010)
  #define USART1_CR3            *(vu32 *)(USART1_BASE + 0x00000014)
  #define USART1_GTPR           *(vu32 *)(USART1_BASE + 0x00000018)

  //--- UART # 2 Registers
  #define USART2_SR             *(vu32 *)(USART2_BASE + 0x00000000)
  #define USART2_DR             *(vu32 *)(USART2_BASE + 0x00000004)
  #define USART2_BRR            *(vu32 *)(USART2_BASE + 0x00000008)
  #define USART2_CR1            *(vu32 *)(USART2_BASE + 0x0000000C)
  #define USART2_CR2            *(vu32 *)(USART2_BASE + 0x00000010)
  #define USART2_CR3            *(vu32 *)(USART2_BASE + 0x00000014)
  #define USART2_GTPR           *(vu32 *)(USART2_BASE + 0x00000018)

  //--- UART # 3 Registers
  #define USART3_SR             *(vu32 *)(USART3_BASE + 0x00000000)
  #define USART3_DR             *(vu32 *)(USART3_BASE + 0x00000004)
  #define USART3_BRR            *(vu32 *)(USART3_BASE + 0x00000008)
  #define USART3_CR1            *(vu32 *)(USART3_BASE + 0x0000000C)
  #define USART3_CR2            *(vu32 *)(USART3_BASE + 0x00000010)
  #define USART3_CR3            *(vu32 *)(USART3_BASE + 0x00000014)
  #define USART3_GTPR           *(vu32 *)(USART3_BASE + 0x00000018)

  //-------------------------------------------------------------------------------------------
  //      I2C Registers
  //-------------------------------------------------------------------------------------------
  //--- I2C Driver #1 Registers
  #define I2C1_CR1              *(vu32 *)(I2C1_BASE + 0x00000000)
  #define I2C1_CR2              *(vu32 *)(I2C1_BASE + 0x00000004)
  #define I2C1_OAR1             *(vu32 *)(I2C1_BASE + 0x00000008)
  #define I2C1_OAR2             *(vu32 *)(I2C1_BASE + 0x0000000C)
  #define I2C1_DR               *(vu32 *)(I2C1_BASE + 0x00000010)
  #define I2C1_SR1              *(vu32 *)(I2C1_BASE + 0x00000014)
  #define I2C1_SR2              *(vu32 *)(I2C1_BASE + 0x00000018)
  #define I2C1_CCR              *(vu32 *)(I2C1_BASE + 0x0000001C)
  #define I2C1_TRISE            *(vu32 *)(I2C1_BASE + 0x00000020)
  #define I2C1_FLTR             *(vu32 *)(I2C1_BASE + 0x00000024)

