Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  //--- I2C Driver #2 Registers
  #define I2C2_CR1              *(vu32 *)(I2C2_BASE + 0x00000000)
  #define I2C2_CR2              *(vu32 *)(I2C2_BASE + 0x00000004)
  #define I2C2_OAR1             *(vu32 *)(I2C2_BASE + 0x00000008)
  #define I2C2_OAR2             *(vu32 *)(I2C2_BASE + 0x0000000C)
  #define I2C2_DR               *(vu32 *)(I2C2_BASE + 0x00000010)
  #define I2C2_SR1              *(vu32 *)(I2C2_BASE + 0x00000014)
  #define I2C2_SR2              *(vu32 *)(I2C2_BASE + 0x00000018)
  #define I2C2_CCR              *(vu32 *)(I2C2_BASE + 0x0000001C)
  #define I2C2_TRISE            *(vu32 *)(I2C2_BASE + 0x00000020)
  #define I2C2_FLTR             *(vu32 *)(I2C2_BASE + 0x00000024)

  //--- I2C Driver #3 Registers
  #define I2C3_CR1              *(vu32 *)(I2C3_BASE + 0x00000000)
  #define I2C3_CR2              *(vu32 *)(I2C3_BASE + 0x00000004)
  #define I2C3_OAR1             *(vu32 *)(I2C3_BASE + 0x00000008)
  #define I2C3_OAR2             *(vu32 *)(I2C3_BASE + 0x0000000C)
  #define I2C3_DR               *(vu32 *)(I2C3_BASE + 0x00000010)
  #define I2C3_SR1              *(vu32 *)(I2C3_BASE + 0x00000014)
  #define I2C3_SR2              *(vu32 *)(I2C3_BASE + 0x00000018)
  #define I2C3_CCR              *(vu32 *)(I2C3_BASE + 0x0000001C)
  #define I2C3_TRISE            *(vu32 *)(I2C3_BASE + 0x00000020)
  #define I2C3_FLTR             *(vu32 *)(I2C3_BASE + 0x00000024)

  //--- I2C Driver #4 Registers
  #define I2C4_CR1              *(vu32 *)(I2C3_BASE + 0x00000000)
  #define I2C4_CR2              *(vu32 *)(I2C3_BASE + 0x00000004)
  #define I2C4_OAR1             *(vu32 *)(I2C3_BASE + 0x00000008)
  #define I2C4_OAR2             *(vu32 *)(I2C3_BASE + 0x0000000C)
  #define I2C4_DR               *(vu32 *)(I2C3_BASE + 0x00000010)
  #define I2C4_SR1              *(vu32 *)(I2C3_BASE + 0x00000014)
  #define I2C4_SR2              *(vu32 *)(I2C3_BASE + 0x00000018)
  #define I2C4_CCR              *(vu32 *)(I2C3_BASE + 0x0000001C)
  #define I2C4_TRISE            *(vu32 *)(I2C3_BASE + 0x00000020)
  #define I2C4_FLTR             *(vu32 *)(I2C3_BASE + 0x00000024)

  //-------------------------------------------------------------------------------------------
  //      SPI Interface Registers
  //-------------------------------------------------------------------------------------------
  //--- SPI Interface 1
  #define SPI1_CR1              *(vu32 *)(SPI1_BASE + 0x00000000)
  #define SPI1_CR2              *(vu32 *)(SPI1_BASE + 0x00000004)
  #define SPI1_SR               *(vu32 *)(SPI1_BASE + 0x00000008)
  #define SPI1_DR               *(vu32 *)(SPI1_BASE + 0x0000000C)
  #define SPI1_CRCPR            *(vu32 *)(SPI1_BASE + 0x00000010)
  #define SPI1_RXCRCR           *(vu32 *)(SPI1_BASE + 0x00000014)
  #define SPI1_TXCRCR           *(vu32 *)(SPI1_BASE + 0x00000018)
  #define SPI1_I2SCFGR          *(vu32 *)(SPI1_BASE + 0x0000001C)
  #define SPI1_SPR              *(vu32 *)(SPI1_BASE + 0x00000020)

  //-------------------------------------------------------------------------------------------
  //      CAN Interface Registers
  //-------------------------------------------------------------------------------------------
  //--- CAN 1 Registers
  #define CAN1_MCR              *(vu32 *)(CAN1_BASE + 0x00000000)
  #define CAN1_MSR              *(vu32 *)(CAN1_BASE + 0x00000004)
  #define CAN1_TSR              *(vu32 *)(CAN1_BASE + 0x00000008)
  #define CAN1_RF0R             *(vu32 *)(CAN1_BASE + 0x0000000C)
  #define CAN1_RF1R             *(vu32 *)(CAN1_BASE + 0x00000010)
  #define CAN1_IER              *(vu32 *)(CAN1_BASE + 0x00000014)
  #define CAN1_ESR              *(vu32 *)(CAN1_BASE + 0x00000018)
  #define CAN1_BTR              *(vu32 *)(CAN1_BASE + 0x0000001C)

  #define CAN1_TIR1             *(vu32 *)(CAN1_BASE + 0x00000180)
  #define CAN1_TDTR1            *(vu32 *)(CAN1_BASE + 0x00000184)
  #define CAN1_TDLR1            *(vu32 *)(CAN1_BASE + 0x00000188)
  #define CAN1_TDHR1            *(vu32 *)(CAN1_BASE + 0x0000018C)
  #define CAN1_TIR2             *(vu32 *)(CAN1_BASE + 0x00000190)
  #define CAN1_TDTR2            *(vu32 *)(CAN1_BASE + 0x00000194)
  #define CAN1_TDLR2            *(vu32 *)(CAN1_BASE + 0x00000198)
  #define CAN1_TDHR2            *(vu32 *)(CAN1_BASE + 0x0000019C)
  #define CAN1_TIR3             *(vu32 *)(CAN1_BASE + 0x000001A0)
  #define CAN1_TDTR3            *(vu32 *)(CAN1_BASE + 0x000001A4)
  #define CAN1_TDLR3            *(vu32 *)(CAN1_BASE + 0x000001A8)
  #define CAN1_TDHR3            *(vu32 *)(CAN1_BASE + 0x000001AC)

  #define CAN1_RIR1             *(vu32 *)(CAN1_BASE + 0x000001B0)
  #define CAN1_RDTR1            *(vu32 *)(CAN1_BASE + 0x000001B4)
  #define CAN1_RDLR1            *(vu32 *)(CAN1_BASE + 0x000001B8)
  #define CAN1_RDHR1            *(vu32 *)(CAN1_BASE + 0x000001BC)
  #define CAN1_RIR2             *(vu32 *)(CAN1_BASE + 0x000001C0)
  #define CAN1_RDTR2            *(vu32 *)(CAN1_BASE + 0x000001C4)
  #define CAN1_RDLR2            *(vu32 *)(CAN1_BASE + 0x000001C8)
  #define CAN1_RDHR2            *(vu32 *)(CAN1_BASE + 0x000001CC)

  #define CAN1_FMR              *(vu32 *)(CAN1_BASE + 0x00000200)
  #define CAN1_FM1R             *(vu32 *)(CAN1_BASE + 0x00000204)
  #define CAN1_FS1R             *(vu32 *)(CAN1_BASE + 0x0000020C)
  #define CAN1_FFA1R            *(vu32 *)(CAN1_BASE + 0x00000214)
  #define CAN1_FA1R             *(vu32 *)(CAN1_BASE + 0x0000021C)

  #define CAN1_FR1_00           *(vu32 *)(CAN1_BASE + 0x00000240)
  #define CAN1_FR2_00           *(vu32 *)(CAN1_BASE + 0x00000244)
  #define CAN1_FR1_01           *(vu32 *)(CAN1_BASE + 0x00000248)
  #define CAN1_FR2_01           *(vu32 *)(CAN1_BASE + 0x0000024C)
  #define CAN1_FR1_02           *(vu32 *)(CAN1_BASE + 0x00000250)
  #define CAN1_FR2_02           *(vu32 *)(CAN1_BASE + 0x00000254)
  #define CAN1_FR1_03           *(vu32 *)(CAN1_BASE + 0x00000258)
  #define CAN1_FR2_03           *(vu32 *)(CAN1_BASE + 0x0000025C)
  #define CAN1_FR1_04           *(vu32 *)(CAN1_BASE + 0x00000260)
  #define CAN1_FR2_04           *(vu32 *)(CAN1_BASE + 0x00000264)
  #define CAN1_FR1_05           *(vu32 *)(CAN1_BASE + 0x00000268)
  #define CAN1_FR2_05           *(vu32 *)(CAN1_BASE + 0x0000026C)
  #define CAN1_FR1_06           *(vu32 *)(CAN1_BASE + 0x00000270)
  #define CAN1_FR2_06           *(vu32 *)(CAN1_BASE + 0x00000274)
  #define CAN1_FR1_07           *(vu32 *)(CAN1_BASE + 0x00000278)
  #define CAN1_FR2_07           *(vu32 *)(CAN1_BASE + 0x0000027C)
  #define CAN1_FR1_08           *(vu32 *)(CAN1_BASE + 0x00000280)
  #define CAN1_FR2_08           *(vu32 *)(CAN1_BASE + 0x00000284)
  #define CAN1_FR1_09           *(vu32 *)(CAN1_BASE + 0x00000288)
  #define CAN1_FR2_09           *(vu32 *)(CAN1_BASE + 0x0000028C)
  #define CAN1_FR1_10           *(vu32 *)(CAN1_BASE + 0x00000290)
  #define CAN1_FR2_10           *(vu32 *)(CAN1_BASE + 0x00000294)
  #define CAN1_FR1_11           *(vu32 *)(CAN1_BASE + 0x00000298)
  #define CAN1_FR2_11           *(vu32 *)(CAN1_BASE + 0x0000029C)
  #define CAN1_FR1_12           *(vu32 *)(CAN1_BASE + 0x000002A0)
  #define CAN1_FR2_12           *(vu32 *)(CAN1_BASE + 0x000002A4)
  #define CAN1_FR1_13           *(vu32 *)(CAN1_BASE + 0x000002A8)
  #define CAN1_FR2_13           *(vu32 *)(CAN1_BASE + 0x000002AC)
  #define CAN1_FR1_14           *(vu32 *)(CAN1_BASE + 0x000002B0)
  #define CAN1_FR2_14           *(vu32 *)(CAN1_BASE + 0x000002B4)
  #define CAN1_FR1_15           *(vu32 *)(CAN1_BASE + 0x000002B8)
  #define CAN1_FR2_15           *(vu32 *)(CAN1_BASE + 0x000002BC)
  #define CAN1_FR1_16           *(vu32 *)(CAN1_BASE + 0x000002C0)
  #define CAN1_FR2_16           *(vu32 *)(CAN1_BASE + 0x000002C4)
  #define CAN1_FR1_17           *(vu32 *)(CAN1_BASE + 0x000002C8)
  #define CAN1_FR2_17           *(vu32 *)(CAN1_BASE + 0x000002CC)
  #define CAN1_FR1_18           *(vu32 *)(CAN1_BASE + 0x000002D0)
  #define CAN1_FR2_18           *(vu32 *)(CAN1_BASE + 0x000002D4)
  #define CAN1_FR1_19           *(vu32 *)(CAN1_BASE + 0x000002D8)
  #define CAN1_FR2_19           *(vu32 *)(CAN1_BASE + 0x000002DC)
  #define CAN1_FR1_20           *(vu32 *)(CAN1_BASE + 0x000002E0)
  #define CAN1_FR2_20           *(vu32 *)(CAN1_BASE + 0x000002E4)
  #define CAN1_FR1_21           *(vu32 *)(CAN1_BASE + 0x000002E8)
  #define CAN1_FR2_21           *(vu32 *)(CAN1_BASE + 0x000002EC)
  #define CAN1_FR1_22           *(vu32 *)(CAN1_BASE + 0x000002F0)
  #define CAN1_FR2_22           *(vu32 *)(CAN1_BASE + 0x000002F4)
  #define CAN1_FR1_23           *(vu32 *)(CAN1_BASE + 0x000002F8)
  #define CAN1_FR2_23           *(vu32 *)(CAN1_BASE + 0x000002FC)
  #define CAN1_FR1_24           *(vu32 *)(CAN1_BASE + 0x00000300)
  #define CAN1_FR2_24           *(vu32 *)(CAN1_BASE + 0x00000304)
  #define CAN1_FR1_25           *(vu32 *)(CAN1_BASE + 0x00000308)
  #define CAN1_FR2_25           *(vu32 *)(CAN1_BASE + 0x0000030C)
  #define CAN1_FR1_26           *(vu32 *)(CAN1_BASE + 0x00000310)
  #define CAN1_FR2_26           *(vu32 *)(CAN1_BASE + 0x00000314)
  #define CAN1_FR1_27           *(vu32 *)(CAN1_BASE + 0x00000318)
  #define CAN1_FR2_27           *(vu32 *)(CAN1_BASE + 0x0000031C)

  //-------------------------------------------------------------------------------------------
  //      DAC Interface Registers
  //-------------------------------------------------------------------------------------------
  //--- DAC #1 Registers
  #define DAC1_CR               *(vu32 *)(DAC1_BASE + 0x00000000)
  #define DAC1_SWTRIGR          *(vu32 *)(DAC1_BASE + 0x00000004)
  #define DAC1_DHR12R1          *(vu32 *)(DAC1_BASE + 0x00000008)
  #define DAC1_DHR12L1          *(vu32 *)(DAC1_BASE + 0x0000000C)
  #define DAC1_DHR8R1           *(vu32 *)(DAC1_BASE + 0x00000010)
  #define DAC1_DHR12R2          *(vu32 *)(DAC1_BASE + 0x00000014)
  #define DAC1_DHR12L2          *(vu32 *)(DAC1_BASE + 0x00000018)
  #define DAC1_DHR8R2           *(vu32 *)(DAC1_BASE + 0x0000001C)
  #define DAC1_DHR12RD          *(vu32 *)(DAC1_BASE + 0x00000020)
  #define DAC1_DHR12LD          *(vu32 *)(DAC1_BASE + 0x00000024)
  #define DAC1_DHR8RD           *(vu32 *)(DAC1_BASE + 0x00000028)
  #define DAC1_DOR1             *(vu32 *)(DAC1_BASE + 0x0000002C)
  #define DAC1_DOR2             *(vu32 *)(DAC1_BASE + 0x00000030)
  #define DAC1_SR               *(vu32 *)(DAC1_BASE + 0x00000034)

  //-------------------------------------------------------------------------------------------
  //      EXTI Interface Registers
  //-------------------------------------------------------------------------------------------
  #define EXTI_IMR              *(vu32 *)(EXTI_BASE + 0x00000000)
  #define EXTI_EMR              *(vu32 *)(EXTI_BASE + 0x00000004)
  #define EXTI_RTSR             *(vu32 *)(EXTI_BASE + 0x00000008)
  #define EXTI_FTSR             *(vu32 *)(EXTI_BASE + 0x0000000C)
  #define EXTI_SWIER            *(vu32 *)(EXTI_BASE + 0x00000010)
  #define EXTI_PR               *(vu32 *)(EXTI_BASE + 0x00000014)

  //-------------------------------------------------------------------------------------------
  //      DMA  Interface Registers
  //-------------------------------------------------------------------------------------------
  //--- DMA #1 Registers
  #define DMA1_LISR             *(vu32 *)(DMA1_BASE + 0x00000000)
  #define DMA1_HISR             *(vu32 *)(DMA1_BASE + 0x00000004)
  #define DMA1_LIFCR            *(vu32 *)(DMA1_BASE + 0x00000008)
  #define DMA1_HIFCR            *(vu32 *)(DMA1_BASE + 0x0000000C)

