Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  #define DMA1_S0CR             *(vu32 *)(DMA1_BASE + 0x00000010)
  #define DMA1_S0NDTR           *(vu32 *)(DMA1_BASE + 0x00000014)
  #define DMA1_S0PAR            *(vu32 *)(DMA1_BASE + 0x00000018)
  #define DMA1_S0M0AR           *(vu32 *)(DMA1_BASE + 0x0000001C)
  #define DMA1_S0M1AR           *(vu32 *)(DMA1_BASE + 0x00000020)
  #define DMA1_S0FCR            *(vu32 *)(DMA1_BASE + 0x00000024)

  #define DMA1_S1CR             *(vu32 *)(DMA1_BASE + 0x00000028)
  #define DMA1_S1NDTR           *(vu32 *)(DMA1_BASE + 0x0000002C)
  #define DMA1_S1PAR            *(vu32 *)(DMA1_BASE + 0x00000030)
  #define DMA1_S1M0AR           *(vu32 *)(DMA1_BASE + 0x00000034)
  #define DMA1_S1M1AR           *(vu32 *)(DMA1_BASE + 0x00000038)
  #define DMA1_S1FCR            *(vu32 *)(DMA1_BASE + 0x0000003C)

  #define DMA1_S2CR             *(vu32 *)(DMA1_BASE + 0x00000040)
  #define DMA1_S2NDTR           *(vu32 *)(DMA1_BASE + 0x00000044)
  #define DMA1_S2PAR            *(vu32 *)(DMA1_BASE + 0x00000048)
  #define DMA1_S2M0AR           *(vu32 *)(DMA1_BASE + 0x0000004C)
  #define DMA1_S2M1AR           *(vu32 *)(DMA1_BASE + 0x00000050)
  #define DMA1_S2FCR            *(vu32 *)(DMA1_BASE + 0x00000054)

  #define DMA1_S3CR             *(vu32 *)(DMA1_BASE + 0x00000058)
  #define DMA1_S3NDTR           *(vu32 *)(DMA1_BASE + 0x0000005C)
  #define DMA1_S3PAR            *(vu32 *)(DMA1_BASE + 0x00000060)
  #define DMA1_S3M0AR           *(vu32 *)(DMA1_BASE + 0x00000064)
  #define DMA1_S3M1AR           *(vu32 *)(DMA1_BASE + 0x00000068)
  #define DMA1_S3FCR            *(vu32 *)(DMA1_BASE + 0x0000006C)

  #define DMA1_S4CR             *(vu32 *)(DMA1_BASE + 0x00000070)
  #define DMA1_S4NDTR           *(vu32 *)(DMA1_BASE + 0x00000074)
  #define DMA1_S4PAR            *(vu32 *)(DMA1_BASE + 0x00000078)
  #define DMA1_S4M0AR           *(vu32 *)(DMA1_BASE + 0x0000007C)
  #define DMA1_S4M1AR           *(vu32 *)(DMA1_BASE + 0x00000080)
  #define DMA1_S4FCR            *(vu32 *)(DMA1_BASE + 0x00000084)

  #define DMA1_S5CR             *(vu32 *)(DMA1_BASE + 0x00000088)
  #define DMA1_S5NDTR           *(vu32 *)(DMA1_BASE + 0x0000008C)
  #define DMA1_S5PAR            *(vu32 *)(DMA1_BASE + 0x00000090)
  #define DMA1_S5M0AR           *(vu32 *)(DMA1_BASE + 0x00000094)
  #define DMA1_S5M1AR           *(vu32 *)(DMA1_BASE + 0x00000098)
  #define DMA1_S5FCR            *(vu32 *)(DMA1_BASE + 0x0000009C)

  #define DMA1_S6CR             *(vu32 *)(DMA1_BASE + 0x000000A0)
  #define DMA1_S6NDTR           *(vu32 *)(DMA1_BASE + 0x000000A4)
  #define DMA1_S6PAR            *(vu32 *)(DMA1_BASE + 0x000000A8)
  #define DMA1_S6M0AR           *(vu32 *)(DMA1_BASE + 0x000000AC)
  #define DMA1_S6M1AR           *(vu32 *)(DMA1_BASE + 0x000000B0)
  #define DMA1_S6FCR            *(vu32 *)(DMA1_BASE + 0x000000B4)

  #define DMA1_S7CR             *(vu32 *)(DMA1_BASE + 0x000000B8)
  #define DMA1_S7NDTR           *(vu32 *)(DMA1_BASE + 0x000000BC)
  #define DMA1_S7PAR            *(vu32 *)(DMA1_BASE + 0x000000C0)
  #define DMA1_S7M0AR           *(vu32 *)(DMA1_BASE + 0x000000C4)
  #define DMA1_S7M1AR           *(vu32 *)(DMA1_BASE + 0x000000C8)
  #define DMA1_S7FCR            *(vu32 *)(DMA1_BASE + 0x000000CC)

  //--- DMA #2 Registers
  #define DMA2_LISR             *(vu32 *)(DMA2_BASE + 0x00000000)
  #define DMA2_HISR             *(vu32 *)(DMA2_BASE + 0x00000004)
  #define DMA2_LIFCR            *(vu32 *)(DMA2_BASE + 0x00000008)
  #define DMA2_HIFCR            *(vu32 *)(DMA2_BASE + 0x0000000C)

  #define DMA2_S0CR             *(vu32 *)(DMA2_BASE + 0x00000010)
  #define DMA2_S0NDTR           *(vu32 *)(DMA2_BASE + 0x00000014)
  #define DMA2_S0PAR            *(vu32 *)(DMA2_BASE + 0x00000018)
  #define DMA2_S0M0AR           *(vu32 *)(DMA2_BASE + 0x0000001C)
  #define DMA2_S0M1AR           *(vu32 *)(DMA2_BASE + 0x00000020)
  #define DMA2_S0FCR            *(vu32 *)(DMA2_BASE + 0x00000024)

  #define DMA2_S1CR             *(vu32 *)(DMA2_BASE + 0x00000028)
  #define DMA2_S1NDTR           *(vu32 *)(DMA2_BASE + 0x0000002C)
  #define DMA2_S1PAR            *(vu32 *)(DMA2_BASE + 0x00000030)
  #define DMA2_S1M0AR           *(vu32 *)(DMA2_BASE + 0x00000034)
  #define DMA2_S1M1AR           *(vu32 *)(DMA2_BASE + 0x00000038)
  #define DMA2_S1FCR            *(vu32 *)(DMA2_BASE + 0x0000003C)

  #define DMA2_S2CR             *(vu32 *)(DMA2_BASE + 0x00000040)
  #define DMA2_S2NDTR           *(vu32 *)(DMA2_BASE + 0x00000044)
  #define DMA2_S2PAR            *(vu32 *)(DMA2_BASE + 0x00000048)
  #define DMA2_S2M0AR           *(vu32 *)(DMA2_BASE + 0x0000004C)
  #define DMA2_S2M1AR           *(vu32 *)(DMA2_BASE + 0x00000050)
  #define DMA2_S2FCR            *(vu32 *)(DMA2_BASE + 0x00000054)

  #define DMA2_S3CR             *(vu32 *)(DMA2_BASE + 0x00000058)
  #define DMA2_S3NDTR           *(vu32 *)(DMA2_BASE + 0x0000005C)
  #define DMA2_S3PAR            *(vu32 *)(DMA2_BASE + 0x00000060)
  #define DMA2_S3M0AR           *(vu32 *)(DMA2_BASE + 0x00000064)
  #define DMA2_S3M1AR           *(vu32 *)(DMA2_BASE + 0x00000068)
  #define DMA2_S3FCR            *(vu32 *)(DMA2_BASE + 0x0000006C)

  #define DMA2_S4CR             *(vu32 *)(DMA2_BASE + 0x00000070)
  #define DMA2_S4NDTR           *(vu32 *)(DMA2_BASE + 0x00000074)
  #define DMA2_S4PAR            *(vu32 *)(DMA2_BASE + 0x00000078)
  #define DMA2_S4M0AR           *(vu32 *)(DMA2_BASE + 0x0000007C)
  #define DMA2_S4M1AR           *(vu32 *)(DMA2_BASE + 0x00000080)
  #define DMA2_S4FCR            *(vu32 *)(DMA2_BASE + 0x00000084)

  #define DMA2_S5CR             *(vu32 *)(DMA2_BASE + 0x00000088)
  #define DMA2_S5NDTR           *(vu32 *)(DMA2_BASE + 0x0000008C)
  #define DMA2_S5PAR            *(vu32 *)(DMA2_BASE + 0x00000090)
  #define DMA2_S5M0AR           *(vu32 *)(DMA2_BASE + 0x00000094)
  #define DMA2_S5M1AR           *(vu32 *)(DMA2_BASE + 0x00000098)
  #define DMA2_S5FCR            *(vu32 *)(DMA2_BASE + 0x0000009C)

  #define DMA2_S6CR             *(vu32 *)(DMA2_BASE + 0x000000A0)
  #define DMA2_S6NDTR           *(vu32 *)(DMA2_BASE + 0x000000A4)
  #define DMA2_S6PAR            *(vu32 *)(DMA2_BASE + 0x000000A8)
  #define DMA2_S6M0AR           *(vu32 *)(DMA2_BASE + 0x000000AC)
  #define DMA2_S6M1AR           *(vu32 *)(DMA2_BASE + 0x000000B0)
  #define DMA2_S6FCR            *(vu32 *)(DMA2_BASE + 0x000000B4)

  #define DMA2_S7CR             *(vu32 *)(DMA2_BASE + 0x000000B8)
  #define DMA2_S7NDTR           *(vu32 *)(DMA2_BASE + 0x000000BC)
  #define DMA2_S7PAR            *(vu32 *)(DMA2_BASE + 0x000000C0)
  #define DMA2_S7M0AR           *(vu32 *)(DMA2_BASE + 0x000000C4)
  #define DMA2_S7M1AR           *(vu32 *)(DMA2_BASE + 0x000000C8)
  #define DMA2_S7FCR            *(vu32 *)(DMA2_BASE + 0x000000CC)

  //-------------------------------------------------------------------------------------------
  //      RTC  Interface Registers
  //-------------------------------------------------------------------------------------------
  #define RTC_TR                *(vu32 *)(RTC_BASE + 0x00000000)
  #define RTC_DR                *(vu32 *)(RTC_BASE + 0x00000004)
  #define RTC_CR                *(vu32 *)(RTC_BASE + 0x00000008)
  #define RTC_ISR               *(vu32 *)(RTC_BASE + 0x0000000C)
  #define RTC_PRER              *(vu32 *)(RTC_BASE + 0x00000010)
  #define RTC_WUTR              *(vu32 *)(RTC_BASE + 0x00000014)
  #define RTC_CALIBR            *(vu32 *)(RTC_BASE + 0x00000018)
  #define RTC_ALRMAR            *(vu32 *)(RTC_BASE + 0x0000001C)
  #define RTC_ALRMBR            *(vu32 *)(RTC_BASE + 0x00000020)
  #define RTC_WPR               *(vu32 *)(RTC_BASE + 0x00000024)
  #define RTC_SSR               *(vu32 *)(RTC_BASE + 0x00000028)
  #define RTC_SHIFTR            *(vu32 *)(RTC_BASE + 0x0000002C)
  #define RTC_TSTR              *(vu32 *)(RTC_BASE + 0x00000030)
  #define RTC_TSDR              *(vu32 *)(RTC_BASE + 0x00000034)
  #define RTC_TSSSR             *(vu32 *)(RTC_BASE + 0x00000038)
  #define RTC_CALR              *(vu32 *)(RTC_BASE + 0x0000003C)
  #define RTC_TAFCR             *(vu32 *)(RTC_BASE + 0x00000040)
  #define RTC_ALRMASSR          *(vu32 *)(RTC_BASE + 0x00000044)
  #define RTC_ALRMBSSR          *(vu32 *)(RTC_BASE + 0x00000048)

  #define RTC_BKP0R             *(vu32 *)(RTC_BASE + 0x00000050)
  #define RTC_BKP1R             *(vu32 *)(RTC_BASE + 0x00000054)
  #define RTC_BKP2R             *(vu32 *)(RTC_BASE + 0x00000058)
  #define RTC_BKP3R             *(vu32 *)(RTC_BASE + 0x0000005C)
  #define RTC_BKP4R             *(vu32 *)(RTC_BASE + 0x00000060)
  #define RTC_BKP5R             *(vu32 *)(RTC_BASE + 0x00000064)
  #define RTC_BKP6R             *(vu32 *)(RTC_BASE + 0x00000068)
  #define RTC_BKP7R             *(vu32 *)(RTC_BASE + 0x0000006C)
  #define RTC_BKP8R             *(vu32 *)(RTC_BASE + 0x00000070)
  #define RTC_BKP9R             *(vu32 *)(RTC_BASE + 0x00000074)
  #define RTC_BKP10R            *(vu32 *)(RTC_BASE + 0x00000078)
  #define RTC_BKP11R            *(vu32 *)(RTC_BASE + 0x0000007C)
  #define RTC_BKP12R            *(vu32 *)(RTC_BASE + 0x00000080)
  #define RTC_BKP13R            *(vu32 *)(RTC_BASE + 0x00000084)
  #define RTC_BKP14R            *(vu32 *)(RTC_BASE + 0x00000088)
  #define RTC_BKP15R            *(vu32 *)(RTC_BASE + 0x0000008C)
  #define RTC_BKP16R            *(vu32 *)(RTC_BASE + 0x00000090)
  #define RTC_BKP17R            *(vu32 *)(RTC_BASE + 0x00000094)
  #define RTC_BKP18R            *(vu32 *)(RTC_BASE + 0x00000098)
  #define RTC_BKP19R            *(vu32 *)(RTC_BASE + 0x0000009C)

  //-------------------------------------------------------------------------------------------
  //    General Purpose Timers
  //-------------------------------------------------------------------------------------------
  //--- Timer #1 registers
  #define TIM1_CR1              *(vu16 *)(TIM1_BASE + 0x00000000)
  #define TIM1_CR2              *(vu16 *)(TIM1_BASE + 0x00000004)
  #define TIM1_SMCR             *(vu16 *)(TIM1_BASE + 0x00000008)
  #define TIM1_DIER             *(vu16 *)(TIM1_BASE + 0x0000000C)
  #define TIM1_SR               *(vu16 *)(TIM1_BASE + 0x00000010)
  #define TIM1_EGR              *(vu16 *)(TIM1_BASE + 0x00000014)
  #define TIM1_CCMR1            *(vu16 *)(TIM1_BASE + 0x00000018)
  #define TIM1_CCMR2            *(vu16 *)(TIM1_BASE + 0x0000001C)
  #define TIM1_CCER             *(vu16 *)(TIM1_BASE + 0x00000020)
  #define TIM1_CNT              *(vu16 *)(TIM1_BASE + 0x00000024)
  #define TIM1_PSC              *(vu16 *)(TIM1_BASE + 0x00000028)
  #define TIM1_ARR              *(vu16 *)(TIM1_BASE + 0x0000002C)
  #define TIM1_RCR              *(vu16 *)(TIM1_BASE + 0x00000030)
  #define TIM1_CCR1             *(vu16 *)(TIM1_BASE + 0x00000034)
  #define TIM1_CCR2             *(vu16 *)(TIM1_BASE + 0x00000038)
  #define TIM1_CCR3             *(vu16 *)(TIM1_BASE + 0x0000003C)
  #define TIM1_CCR4             *(vu16 *)(TIM1_BASE + 0x00000040)
  #define TIM1_BDTR             *(vu16 *)(TIM1_BASE + 0x00000044)
  #define TIM1_DCR              *(vu16 *)(TIM1_BASE + 0x00000048)
  #define TIM1_DMAR             *(vu16 *)(TIM1_BASE + 0x0000004C)

  //--- Timer #2 registers
  #define TIM2_CR1              *(vu16 *)(TIM2_BASE + 0x00000000)
  #define TIM2_CR2              *(vu16 *)(TIM2_BASE + 0x00000004)
  #define TIM2_SMCR             *(vu32 *)(TIM2_BASE + 0x00000008)
  #define TIM2_DIER             *(vu16 *)(TIM2_BASE + 0x0000000C)
  #define TIM2_SR               *(vu16 *)(TIM2_BASE + 0x00000010)
  #define TIM2_EGR              *(vu16 *)(TIM2_BASE + 0x00000014)
  #define TIM2_CCMR1            *(vu32 *)(TIM2_BASE + 0x00000018)
  #define TIM2_CCMR2            *(vu32 *)(TIM2_BASE + 0x0000001C)
  #define TIM2_CCER             *(vu16 *)(TIM2_BASE + 0x00000020)
  #define TIM2_CNT              *(vu32 *)(TIM2_BASE + 0x00000024)
  #define TIM2_PSC              *(vu16 *)(TIM2_BASE + 0x00000028)
  #define TIM2_ARR              *(vu16 *)(TIM2_BASE + 0x0000002C)
  #define TIM2_CCR1             *(vu32 *)(TIM2_BASE + 0x00000034)
  #define TIM2_CCR2             *(vu32 *)(TIM2_BASE + 0x00000038)
  #define TIM2_CCR3             *(vu32 *)(TIM2_BASE + 0x0000003C)
  #define TIM2_CCR4             *(vu32 *)(TIM2_BASE + 0x00000040)
  #define TIM2_DCR              *(vu16 *)(TIM2_BASE + 0x00000048)
  #define TIM2_DMAR             *(vu16 *)(TIM2_BASE + 0x0000004C)

  //--- Timer #3 registers
  #define TIM3_CR1              *(vu16 *)(TIM3_BASE + 0x00000000)
  #define TIM3_CR2              *(vu16 *)(TIM3_BASE + 0x00000004)
  #define TIM3_SMCR             *(vu16 *)(TIM3_BASE + 0x00000008)
  #define TIM3_DIER             *(vu16 *)(TIM3_BASE + 0x0000000C)
  #define TIM3_SR               *(vu16 *)(TIM3_BASE + 0x00000010)
  #define TIM3_EGR              *(vu16 *)(TIM3_BASE + 0x00000014)
  #define TIM3_CCMR1            *(vu16 *)(TIM3_BASE + 0x00000018)
  #define TIM3_CCMR2            *(vu16 *)(TIM3_BASE + 0x0000001C)
  #define TIM3_CCER             *(vu16 *)(TIM3_BASE + 0x00000020)
  #define TIM3_CNT              *(vu16 *)(TIM3_BASE + 0x00000024)
  #define TIM3_PSC              *(vu16 *)(TIM3_BASE + 0x00000028)
  #define TIM3_ARR              *(vu16 *)(TIM3_BASE + 0x0000002C)
  #define TIM3_CCR1             *(vu16 *)(TIM3_BASE + 0x00000034)
  #define TIM3_CCR2             *(vu16 *)(TIM3_BASE + 0x00000038)
  #define TIM3_CCR3             *(vu16 *)(TIM3_BASE + 0x0000003C)
  #define TIM3_CCR4             *(vu16 *)(TIM3_BASE + 0x00000040)
  #define TIM3_DCR              *(vu16 *)(TIM3_BASE + 0x00000048)
  #define TIM3_DMAR             *(vu16 *)(TIM3_BASE + 0x0000004C)

