Quorbinc/Q-32_skeleton_code/rtos/STM32L432_Map.h
  //--- Timer #6 registers
  #define TIM6_CR1              *(vu16 *)(TIM6_BASE + 0x00000000)
  #define TIM6_CR2              *(vu16 *)(TIM6_BASE + 0x00000004)
  #define TIM6_SMCR             *(vu16 *)(TIM6_BASE + 0x00000008)
  #define TIM6_DIER             *(vu16 *)(TIM6_BASE + 0x0000000C)
  #define TIM6_SR               *(vu16 *)(TIM6_BASE + 0x00000010)
  #define TIM6_EGR              *(vu16 *)(TIM6_BASE + 0x00000014)
  #define TIM6_CCMR1            *(vu16 *)(TIM6_BASE + 0x00000018)
  #define TIM6_CCMR2            *(vu16 *)(TIM6_BASE + 0x0000001C)
  #define TIM6_CCER             *(vu16 *)(TIM6_BASE + 0x00000020)
  #define TIM6_CNT              *(vu16 *)(TIM6_BASE + 0x00000024)
  #define TIM6_PSC              *(vu16 *)(TIM6_BASE + 0x00000028)
  #define TIM6_ARR              *(vu16 *)(TIM6_BASE + 0x0000002C)
  #define TIM6_CCR1             *(vu16 *)(TIM6_BASE + 0x00000034)
  #define TIM6_CCR2             *(vu16 *)(TIM6_BASE + 0x00000038)
  #define TIM6_CCR3             *(vu16 *)(TIM6_BASE + 0x0000003C)
  #define TIM6_CCR4             *(vu16 *)(TIM6_BASE + 0x00000040)
  #define TIM6_DCR              *(vu16 *)(TIM6_BASE + 0x00000048)
  #define TIM6_DMAR             *(vu16 *)(TIM6_BASE + 0x0000004C)

  //--- Timer #7 registers
  #define TIM7_CR1              *(vu16 *)(TIM7_BASE + 0x00000000)
  #define TIM7_CR2              *(vu16 *)(TIM7_BASE + 0x00000004)
  #define TIM7_SMCR             *(vu16 *)(TIM7_BASE + 0x00000008)
  #define TIM7_DIER             *(vu16 *)(TIM7_BASE + 0x0000000C)
  #define TIM7_SR               *(vu16 *)(TIM7_BASE + 0x00000010)
  #define TIM7_EGR              *(vu16 *)(TIM7_BASE + 0x00000014)
  #define TIM7_CCMR1            *(vu16 *)(TIM7_BASE + 0x00000018)
  #define TIM7_CCMR2            *(vu16 *)(TIM7_BASE + 0x0000001C)
  #define TIM7_CCER             *(vu16 *)(TIM7_BASE + 0x00000020)
  #define TIM7_CNT              *(vu16 *)(TIM7_BASE + 0x00000024)
  #define TIM7_PSC              *(vu16 *)(TIM7_BASE + 0x00000028)
  #define TIM7_ARR              *(vu16 *)(TIM7_BASE + 0x0000002C)
  #define TIM7_CCR1             *(vu16 *)(TIM7_BASE + 0x00000034)
  #define TIM7_CCR2             *(vu16 *)(TIM7_BASE + 0x00000038)
  #define TIM7_CCR3             *(vu16 *)(TIM7_BASE + 0x0000003C)
  #define TIM7_CCR4             *(vu16 *)(TIM7_BASE + 0x00000040)
  #define TIM7_DCR              *(vu16 *)(TIM7_BASE + 0x00000048)
  #define TIM7_DMAR             *(vu16 *)(TIM7_BASE + 0x0000004C)

  //--- Timer #15 registers
  #define TIM15_CR1             *(vu16 *)(TIM15_BASE + 0x00000000)
  #define TIM15_CR2             *(vu16 *)(TIM15_BASE + 0x00000004)
  #define TIM15_SMCR            *(vu16 *)(TIM15_BASE + 0x00000008)
  #define TIM15_DIER            *(vu16 *)(TIM15_BASE + 0x0000000C)
  #define TIM15_SR              *(vu16 *)(TIM15_BASE + 0x00000010)
  #define TIM15_EGR             *(vu16 *)(TIM15_BASE + 0x00000014)
  #define TIM15_CCMR1           *(vu16 *)(TIM15_BASE + 0x00000018)
  #define TIM15_CCMR2           *(vu16 *)(TIM15_BASE + 0x0000001C)
  #define TIM15_CCER            *(vu16 *)(TIM15_BASE + 0x00000020)
  #define TIM15_CNT             *(vu16 *)(TIM15_BASE + 0x00000024)
  #define TIM15_PSC             *(vu16 *)(TIM15_BASE + 0x00000028)
  #define TIM15_ARR             *(vu16 *)(TIM15_BASE + 0x0000002C)
  #define TIM15_RCR             *(vu16 *)(TIM15_BASE + 0x00000030)
  #define TIM15_CCR1            *(vu16 *)(TIM15_BASE + 0x00000034)
  #define TIM15_CCR2            *(vu16 *)(TIM15_BASE + 0x00000038)
  #define TIM15_CCR3            *(vu16 *)(TIM15_BASE + 0x0000003C)
  #define TIM15_CCR4            *(vu16 *)(TIM15_BASE + 0x00000040)
  #define TIM15_BDTR            *(vu16 *)(TIM15_BASE + 0x00000044)
  #define TIM15_DCR             *(vu16 *)(TIM15_BASE + 0x00000048)
  #define TIM15_DMAR            *(vu16 *)(TIM15_BASE + 0x0000004C)

  //--- Timer #16 registers
  #define TIM16_CR1             *(vu16 *)(TIM16_BASE + 0x00000000)
  #define TIM16_CR2             *(vu16 *)(TIM16_BASE + 0x00000004)
  #define TIM16_SMCR            *(vu16 *)(TIM16_BASE + 0x00000008)
  #define TIM16_DIER            *(vu16 *)(TIM16_BASE + 0x0000000C)
  #define TIM16_SR              *(vu16 *)(TIM16_BASE + 0x00000010)
  #define TIM16_EGR             *(vu16 *)(TIM16_BASE + 0x00000014)
  #define TIM16_CCMR1           *(vu16 *)(TIM16_BASE + 0x00000018)
  #define TIM16_CCMR2           *(vu16 *)(TIM16_BASE + 0x0000001C)
  #define TIM16_CCER            *(vu16 *)(TIM16_BASE + 0x00000020)
  #define TIM16_CNT             *(vu16 *)(TIM16_BASE + 0x00000024)
  #define TIM16_PSC             *(vu16 *)(TIM16_BASE + 0x00000028)
  #define TIM16_ARR             *(vu16 *)(TIM16_BASE + 0x0000002C)
  #define TIM16_RCR             *(vu16 *)(TIM16_BASE + 0x00000030)
  #define TIM16_CCR1            *(vu16 *)(TIM16_BASE + 0x00000034)
  #define TIM16_CCR2            *(vu16 *)(TIM16_BASE + 0x00000038)
  #define TIM16_CCR3            *(vu16 *)(TIM16_BASE + 0x0000003C)
  #define TIM16_CCR4            *(vu16 *)(TIM16_BASE + 0x00000040)
  #define TIM16_BDTR            *(vu16 *)(TIM16_BASE + 0x00000044)
  #define TIM16_DCR             *(vu16 *)(TIM16_BASE + 0x00000048)
  #define TIM16_DMAR            *(vu16 *)(TIM16_BASE + 0x0000004C)

  //-------------------------------------------------------------------------------------------
  //    LP Timer  registers
  //    LP Timer  = 16 bit general timer
  //-------------------------------------------------------------------------------------------
  #define LPTIM_CR1             *(vu32 *)(LPTIM_BASE + 0x00000000)
  #define LPTIM_CR2             *(vu32 *)(LPTIM_BASE + 0x00000004)
  #define LPTIM_SMCR            *(vu32 *)(LPTIM_BASE + 0x00000008)
  #define LPTIM_DIER            *(vu32 *)(LPTIM_BASE + 0x0000000C)
  #define LPTIM_SR              *(vu32 *)(LPTIM_BASE + 0x00000010)
  #define LPTIM_EGR             *(vu32 *)(LPTIM_BASE + 0x00000014)
  #define LPTIM_CCMR1           *(vu32 *)(LPTIM_BASE + 0x00000018)
  #define LPTIM_CCMR2           *(vu32 *)(LPTIM_BASE + 0x0000001C)
  #define LPTIM_CCER            *(vu32 *)(LPTIM_BASE + 0x00000020)
  #define LPTIM_CNT             *(vu32 *)(LPTIM_BASE + 0x00000024)
  #define LPTIM_PSC             *(vu32 *)(LPTIM_BASE + 0x00000028)
  #define LPTIM_ARR             *(vu32 *)(LPTIM_BASE + 0x0000002C)
  #define LPTIM_RCR             *(vu32 *)(LPTIM_BASE + 0x00000030)
  #define LPTIM_CCR1            *(vu32 *)(LPTIM_BASE + 0x00000034)
  #define LPTIM_CCR2            *(vu32 *)(LPTIM_BASE + 0x00000038)
  #define LPTIM_CCR3            *(vu32 *)(LPTIM_BASE + 0x0000003C)
  #define LPTIM_CCR4            *(vu32 *)(LPTIM_BASE + 0x00000040)
  #define LPTIM_BDTR            *(vu32 *)(LPTIM_BASE + 0x00000044)
  #define LPTIM_DCR             *(vu32 *)(LPTIM_BASE + 0x00000048)
  #define LPTIM_DMAR            *(vu32 *)(LPTIM_BASE + 0x0000004C)

  //-------------------------------------------------------------------------------------------
  //    UART Register Maps
  //-------------------------------------------------------------------------------------------
  //--- UART # 1 Registers
  #define USART1_SR             *(vu32 *)(USART1_BASE + 0x00000000)
  #define USART1_DR             *(vu32 *)(USART1_BASE + 0x00000004)
  #define USART1_BRR            *(vu32 *)(USART1_BASE + 0x00000008)
  #define USART1_CR1            *(vu32 *)(USART1_BASE + 0x0000000C)
  #define USART1_CR2            *(vu32 *)(USART1_BASE + 0x00000010)
  #define USART1_CR3            *(vu32 *)(USART1_BASE + 0x00000014)
  #define USART1_GTPR           *(vu32 *)(USART1_BASE + 0x00000018)

  //--- UART # 2 Registers
  #define USART2_SR             *(vu32 *)(USART2_BASE + 0x00000000)
  #define USART2_DR             *(vu32 *)(USART2_BASE + 0x00000004)
  #define USART2_BRR            *(vu32 *)(USART2_BASE + 0x00000008)
  #define USART2_CR1            *(vu32 *)(USART2_BASE + 0x0000000C)
  #define USART2_CR2            *(vu32 *)(USART2_BASE + 0x00000010)
  #define USART2_CR3            *(vu32 *)(USART2_BASE + 0x00000014)
  #define USART2_GTPR           *(vu32 *)(USART2_BASE + 0x00000018)

  //-------------------------------------------------------------------------------------------
  //      QUADSPI Interface Registers
  //-------------------------------------------------------------------------------------------
  #define QUADSPI_CR            *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_DCR           *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_SR            *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_FCR           *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_DLR           *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_CCR           *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_AR            *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_ABR           *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_DR            *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_PSMKR         *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_PSMAR         *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_PIR           *(vu32 *)(QUADSPI_BASE + 0x00000000)
  #define QUADSPI_LPTR          *(vu32 *)(QUADSPI_BASE + 0x00000000)

  //-------------------------------------------------------------------------------------------
  //      Random Number Generator
  //-------------------------------------------------------------------------------------------
  #define RNG_CR                *(vu32 *)(RNG_BASE + 0x00000000)
  #define RNG_SR                *(vu32 *)(RNG_BASE + 0x00000004)
  #define RNG_DR                *(vu32 *)(RNG_BASE + 0x00000008)

  //-------------------------------------------------------------------------------------------
  //      USB Register Location Map
  //-------------------------------------------------------------------------------------------
  #define USB_DEVICE_BASE                  *(vu32 *)(USB_BASE + 0x0800U)
  #define USB_IN_ENDPOINT_BASE             *(vu32 *)(USB_BASE + 0x0900U)
  #define USB_OUT_ENDPOINT_BASE            *(vu32 *)(USB_BASE + 0x0B00U)
  #define USB_HOST_BASE                    *(vu32 *)(USB_BASE + 0x0400U)
  #define USB_HOST_PORT_BASE               *(vu32 *)(USB_BASE + 0x0440U)
  #define USB_HOST_CHANNEL_BASE            *(vu32 *)(USB_BASE + 0x0500U)
  #define USB_PCGCCTL_BASE                 *(vu32 *)(USB_BASE + 0x0E00U)
  #define USB_FIFO_BASE                    *(vu32 *)(USB_BASE + 0x1000U)

  #define USB_EP_REG_SIZE                  ((u32 )0x20U)
  #define USB_HOST_CHANNEL_SIZE            ((u32 )0x20U)
  #define USB_FIFO_SIZE                    ((u32 )0x1000U)

  #define USB_EP0R                         USB_BASE                           //--- endpoint 0 register address
  #define USB_EP1R                         *(vu32 *)(USB_BASE + 0x00000004UL) //--- endpoint 1 register address
  #define USB_EP2R                         *(vu32 *)(USB_BASE + 0x00000008UL) //--- endpoint 2 register address
  #define USB_EP3R                         *(vu32 *)(USB_BASE + 0x0000000CUL) //--- endpoint 3 register address
  #define USB_EP4R                         *(vu32 *)(USB_BASE + 0x00000010UL) //--- endpoint 4 register address
  #define USB_EP5R                         *(vu32 *)(USB_BASE + 0x00000014UL) //--- endpoint 5 register address
  #define USB_EP6R                         *(vu32 *)(USB_BASE + 0x00000018UL) //--- endpoint 6 register address
  #define USB_EP7R                         *(vu32 *)(USB_BASE + 0x0000001CUL) //--- endpoint 7 register address

  //-------------------------------------------------------------------------------------------
  //      USB Device FS General registers
  //-------------------------------------------------------------------------------------------
  #define USB_CNTR                         *(vu32 *)(USB_BASE + 0x00000040UL) //--- Control register
  #define USB_ISTR                         *(vu32 *)(USB_BASE + 0x00000044UL) //--- Interrupt status register
  #define USB_FNR                          *(vu32 *)(USB_BASE + 0x00000048UL) //--- Frame number register
  #define USB_DADDR                        *(vu32 *)(USB_BASE + 0x0000004CUL) //--- Device address register
  #define USB_BTABLE                       *(vu32 *)(USB_BASE + 0x00000050UL) //--- Buffer Table address register
  #define USB_LPMCSR                       *(vu32 *)(USB_BASE + 0x00000054UL) //--- LPM Control and Status register
  #define USB_BCDR                         *(vu32 *)(USB_BASE + 0x00000058UL) //--- Battery Charging detector register

  //-------------------------------------------------------------------------------------------
  //    Windowed Watch Dog
  //-------------------------------------------------------------------------------------------
  #define WWDG_CR                          *(vu32 *)(WWDG_BASE + 0x00000000)
  #define WWDG_CFR                         *(vu32 *)(WWDG_BASE + 0x00000004)
  #define WWDG_SR                          *(vu32 *)(WWDG_BASE + 0x00000008)

  //-------------------------------------------------------------------------------------------
  //    Idependant Watch Dog
  //-------------------------------------------------------------------------------------------
  #define IWDG_KR                          *(vu32 *)(IWDG_BASE + 0x00000000)
  #define IWDG_PR                          *(vu32 *)(IWDG_BASE + 0x00000004)
  #define IWDG_RLR                         *(vu32 *)(IWDG_BASE + 0x00000008)
  #define IWDG_SR                          *(vu32 *)(IWDG_BASE + 0x0000000C)

  //-------------------------------------------------------------------------------------------
  //    SDIO Interface
  //-------------------------------------------------------------------------------------------
  #define SDIO_POWER                       *(vu32 *)(SDIO_BASE + 0x00000000)
  #define SDIO_CLKCR                       *(vu32 *)(SDIO_BASE + 0x00000004)
  #define SDIO_ARG                         *(vu32 *)(SDIO_BASE + 0x00000008)
  #define SDIO_CMD                         *(vu32 *)(SDIO_BASE + 0x0000000C)
  #define SDIO_RESPCMD                     *(vu32 *)(SDIO_BASE + 0x00000010)
  #define SDIO_RESP1                       *(vu32 *)(SDIO_BASE + 0x00000014)
  #define SDIO_RESP2                       *(vu32 *)(SDIO_BASE + 0x00000018)
  #define SDIO_RESP3                       *(vu32 *)(SDIO_BASE + 0x0000001C)
  #define SDIO_RESP4                       *(vu32 *)(SDIO_BASE + 0x00000020)
  #define SDIO_DTIMER                      *(vu32 *)(SDIO_BASE + 0x00000024)
  #define SDIO_DLEN                        *(vu32 *)(SDIO_BASE + 0x00000028)
  #define SDIO_DCTRL                       *(vu32 *)(SDIO_BASE + 0x0000002C)
  #define SDIO_DCOUNT                      *(vu32 *)(SDIO_BASE + 0x00000030)
  #define SDIO_STA                         *(vu32 *)(SDIO_BASE + 0x00000034)
  #define SDIO_ICR                         *(vu32 *)(SDIO_BASE + 0x00000038)
  #define SDIO_MASK                        *(vu32 *)(SDIO_BASE + 0x0000003C)
  #define SDIO_FIFOCNT                     *(vu32 *)(SDIO_BASE + 0x00000048)
  #define SDIO_FIFO                        *(vu32 *)(SDIO_BASE + 0x00000080)

  //-------------------------------------------------------------------------------------------
  //    Serial Audio Interface
  //-------------------------------------------------------------------------------------------




//  #ifdef __cplusplus
//    }
//  #endif
#endif

//|....|....|....*....|....|....*....|....|....^....|....|....*....|....|....*....|....|....|..

//=============================================================================================
//
//=============================================================================================

//---------------------------------------------------------------------------------------------
//
//---------------------------------------------------------------------------------------------

  //:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

  //-------------------------------------------------------------------------------------------
  //
  //-------------------------------------------------------------------------------------------

    //-----------------------------------------------------------------------------------------
    //
    //-----------------------------------------------------------------------------------------

      //---------------------------------------------------------------------------------------
      //
      //---------------------------------------------------------------------------------------
